//package com.bypriyan.sharemarketcourseinhindi.topicsDatas
//
//import com.bypriyan.bustrackingsystem.utility.Constants
//import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic
//
//object Bonds {
//
//    fun getBondsList(): List<ModelSubTopic> {
//        return listOf(
//            ModelSubTopic(id = 1, topic = Constants.KEY_TOPIC_BONDS, title = "Bond क्या है?", description = "एक बॉन्ड एक तरह का ऋण होता है। जब आप बॉन्ड खरीदते हैं, तो आप संस्था या सरकार को ऋण देते हैं। उत्पादक या सरकार आपको\n" +
//                    "ब्याज के साथ उस ऋण की राशि वापस करती है। बॉन्ड को आप एक नि श्चि त समयानुसार वापस प्राप्त कर सकते हैं, और यह आपको नि श्चि त\n" +
//                    "राशि में नि र्धारि त लाभ प्रदान करता है।\n" +
//                    "उदाहरण के लि ए, यदि आप 10,000 रुपये की एक सरकारी बॉन्ड खरीदते हैं जि सका 5% ब्याज है, तो आपको प्रति वर्ष 500 रुपये का ब्याज\n" +
//                    "मि लेगा। इसके अलावा, जब बॉन्ड का समय समाप्त होता है, तो आपको मूल राशि भी वापस मि लती है।", imgUrl = "https://media.istockphoto.com/id/1282186968/vector/woman-invests-in-bonds-receive-coupons-concept-of-return-on-investment-financial-solutions.jpg?s=612x612&w=0&k=20&c=ufjm9HW8tsV2gqGtkjMTlKMLC-8gOvWdDb7RVrWvTBM="),
//            ModelSubTopic(id = 2, topic = Constants.KEY_TOPIC_BONDS, title = "भारत में बॉन्ड के प्रकार", description = "भारत में वि भि न्न प्रकार के बॉन्ड होते हैं, जि नमें शामि ल हैं:\n" +
//                    "1. सरकारी बॉन्ड: ये राष्ट्र ीय और राज्य सरकारों द्वारा जारी कि ए गए होते हैं। इनमें शामि ल हैं सरकारी ऋण पत्र (Government\n" +
//                    "Securities) और सरकारी उद्यम बोर्ड (Government Enterprise Bonds)।\n" +
//                    "2. कॉर्पो रेट बॉन्ड: ये कि सी नि जी कंपनी द्वारा जारी कि ए जाते हैं। यह कंपनी अपनी वि कास योजनाओं को समर्थन करने के लि ए\n" +
//                    "नि वेशकों से पूंजी उठाती है।\n" +
//                    "3. मन्नग्म बॉन्ड: ये बॉन्ड नि जी और सार्वजनि क क्षेत्रों के वि कास के लि ए जारी कि ए जाते हैं, जैसे कि शि क्षा, स्वास्थ्य, और परि वहन।\n" +
//                    "4. भावी बॉन्ड: ये ऐसे बॉन्ड होते हैं जि न्हें भवि ष्य में खरीदा जा सकता है, लेकि न उनकी मूल्यांकन वाणि ज्यि क दि न के लि ए नही ं कि या\n" +
//                    "जाता है।\n" +
//                    "5. अन्य बॉन्ड: इसमें मुद्रा बॉन्ड, नि गम बॉन्ड, और गोल्ड बॉन्ड शामि ल हैं।\n" +
//                    "इन बॉन्ड के प्रकारों में कुछ अंतर हो सकते हैं, लेकि न उन सभी का मुख्य उद्देश्य नि वेशकों को नि यमि त ब्याज और नि वेश के लि ए स्थायि त्व\n" +
//                    "प्रदान करना होता है।", imgUrl = "https://media.istockphoto.com/id/1282186968/vector/woman-invests-in-bonds-receive-coupons-concept-of-return-on-investment-financial-solutions.jpg?s=612x612&w=0&k=20&c=ufjm9HW8tsV2gqGtkjMTlKMLC-8gOvWdDb7RVrWvTBM="),
//            ModelSubTopic(id = 3, topic = Constants.KEY_TOPIC_BONDS, title = "भारत में Bond कैसे ख़रीदे?", description = "भारत में बॉन्ड्स खरीदने के लि ए नि म्नलि खित तरीके हो सकते हैं:\n" +
//                    "1. प्राथमि क बाजार (Primary Market): इसमें, सरकारी और नि जी कंपनि याँ अपने नए बॉन्ड्स की पेशकश करती हैं। आप\n" +
//                    "बॉन्ड्स को सीधे इस बाजार में खरीद सकते हैं।\n" +
//                    "2. द्वि तीय बाजार (Secondary Market): यह बाजार प्राथमि क बाजार के बाद बॉन्ड्स की खरीददारी के लि ए होता है। इसमें, पहले\n" +
//                    "से बाजार में उपलब्ध बॉन्ड्स खरीदे जा सकते हैं।\n" +
//                    "3. बैंक और वि त्तीय संस्थान: कई बैंक और वि त्तीय संस्थान अपने ग्राहकों को बॉन्ड्स के लि ए वि भि न्न योजनाएँ प्रदान करते हैं। आप\n" +
//                    "इन संस्थानों के माध्यम से भी बॉन्ड्स खरीद सकते हैं।\n" +
//                    "4. ऑनलाइन ब्रोकरेज खाता: ऑनलाइन ब्रोकरेज कंपनि यों के माध्यम से भी आप बॉन्ड्स खरीद सकते हैं। आपको एक ऑनलाइन\n" +
//                    "ब्रोकर कंपनी के साथ खाता खोलना होगा और फि र आप उनके वेबसाइट या एप्लि केशन के माध्यम से बॉन्ड्स खरीद सकें गे।\n" +
//                    "ध्यान दें कि बॉन्ड्स का मूल्य और ब्याज दर बाजार के वि भि न्न परि स्थि ति यों के अनुसार परि वर्ति त होते रहते हैं, इसलि ए आपको पहले पूरी तरह\n" +
//                    "से अध्ययन करना चाहि ए और उसके बाद नि वेश का नि र्णय लेना चाहि ए।\n" +
//                    "शेयर और बॉन्ड में क्या अंतर है?\n" +
//                    "शेयर और बॉन्ड दोनों ही नि वेश के प्रमुख साधन होते हैं, लेकि न इनमें कुछ मुख्य अंतर होते हैं। यहां वे अंतर कुछ मुख्य दृष्टि कोणों से समझाए\n" +
//                    "गए हैं:\n" +
//                    "1. स्वामि त्व:\n" +
//                    "\uF0B7 शेयर: शेयर के धारक को कंपनी की मालि काना स्वामि त्व का हि स्सा होता है। यह नि वेशक के लि ए कंपनी के लाभांश\n" +
//                    "का हि स्सा और मतदान का अधि कार प्रदान करता है।\n" +
//                    "\uF0B7 बॉन्ड: बॉन्ड नि वेशक को एक कंपनी, सरकार, या अन्य संस्था के ऋण का धारक बनाता है, और वे ऋण के ब्याज को\n" +
//                    "वापि स प्राप्त करने के लि ए नि र्धारि त समयावधि के लि ए एक नि श्चि त राशि पर ब्याज प्राप्त करते हैं। बॉन्ड के धारक को\n" +
//                    "कंपनी या संस्था के लि ए कोई स्वामि त्व का हि स्सा नहीं होता।\n" +
//                    "2. लाभ:\n" +
//                    "\uF0B7 शेयर: शेयरधारक का लाभ कंपनी के आय और मार्जि न के साथ संबंधि त होता है, और इसमें लाभ का कोई नि श्चि त\n" +
//                    "गारंटी नही ं होता।\n" +
//                    "\uF0B7 बॉन्ड: बॉन्ड नि वेशक को नि श्चि त समयावधि के दौरान नि र्धारि त ब्याज के रूप में नि श्चि त लाभ प्रदान करता है। यह लाभ\n" +
//                    "सामान्यत: नि श्चि त और स्थि र होता है।\n" +
//                    "3. रिस्क:\n" +
//                    "\uF0B7 शेयर: शेयरों की कीमतों में उतार-चढ़ाव होता है और इसमें नि वेशकों को उच्च वि त्तीय रिस्क लेना पड़ता है।\n" +
//                    "\uF0B7 बॉन्ड: बॉन्ड आमतौर पर नि श्चि त और स्थि र होते हैं और नि वेशकों को उत्कृ ष्ट आंतरि क सुरक्षा प्रदान करते हैं।\n" +
//                    "4. लि क्विडि टी:\n" +
//                    "\uF0B7 शेयर: शेयरों की लि क्विडि टी उनकी लि स्टि ंग और उनकी व्यापकता के आधार पर वि भि न्न होती है।\n" +
//                    "\uF0B7 बॉन्ड: बॉन्ड आमतौर पर शेयरो ं की तुलना में अधि क लि क्विड होते हैं, क्योकिं उन्हें सीमि त अवधि के दौरान भी बाजार में\n" +
//                    "बेचा और खरीदा जा सकता है।\n" +
//                    "इस प्रकार, शेयर और बॉन्ड दोनों ही वि भि न्न वि त्तीय उद्देश्यों के लि ए उपयुक्त हो सकते हैं, और नि वेशकों को इन अंतरों को समझकर उनके\n" +
//                    "नि वेश नि र्णय लेने में मदद मि लती है।", imgUrl = "https://media.istockphoto.com/id/1282186968/vector/woman-invests-in-bonds-receive-coupons-concept-of-return-on-investment-financial-solutions.jpg?s=612x612&w=0&k=20&c=ufjm9HW8tsV2gqGtkjMTlKMLC-8gOvWdDb7RVrWvTBM=")
//            )
//    }
//
//}

package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Bonds {
    fun getBondsList(): List<ModelSubTopic> {
        return listOf(
            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_BONDS,
                title = "Bond क्या है?",
                description = "एक बॉन्ड एक तरह का ऋण होता है। जब आप बॉन्ड खरीदते हैं, तो आप संस्था या सरकार को ऋण देते हैं। उत्पादक या सरकार आपको ब्याज के साथ उस ऋण की राशि वापस करती है। बॉन्ड को आप एक निश्चित समयानुसार वापस प्राप्त कर सकते हैं, और यह आपको निश्चित राशि में निर्धारित लाभ प्रदान करता है। उदाहरण के लिए, यदि आप 10,000 रुपये की एक सरकारी बॉन्ड खरीदते हैं जिसका 5% ब्याज है, तो आपको प्रति वर्ष 500 रुपये का ब्याज मिलेगा। इसके अलावा, जब बॉन्ड का समय समाप्त होता है, तो आपको मूल राशि भी वापस मिलती है।",
                imgUrl = "https://media.istockphoto.com/id/1282186968/vector/woman-invests-in-bonds-receive-coupons-concept-of-return-on-investment-financial-solutions.jpg?s=612x612&w=0&k=20&c=ufjm9HW8tsV2gqGtkjMTlKMLC-8gOvWdDb7RVrWvTBM="
            ),
            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_BONDS,
                title = "भारत में बॉन्ड के प्रकार",
                description = "भारत में विभिन्न प्रकार के बॉन्ड होते हैं, जिनमें शामिल हैं:\n" +
                        "\n1. सरकारी बॉन्ड: ये राष्ट्रीय और राज्य सरकारों द्वारा जारी किए गए होते हैं। इनमें शामिल हैं सरकारी ऋण पत्र (Government Securities) और सरकारी उद्यम बोर्ड (Government Enterprise Bonds)।\n" +
                        "\n2. कॉर्पोरेट बॉन्ड: ये किसी निजी कंपनी द्वारा जारी किए जाते हैं। यह कंपनी अपनी विकास योजनाओं को समर्थन करने के लिए निवेशकों से पूंजी उठाती है।\n" +
                        "\n3. मुद्राग्म बॉन्ड: ये बॉन्ड निजी और सार्वजनिक क्षेत्रों के विकास के लिए जारी किए जाते हैं, जैसे कि शिक्षा, स्वास्थ्य, और परिवहन।\n" +
                        "\n4. भविष्य बॉन्ड: ये ऐसे बॉन्ड होते हैं जिन्हें भविष्य में खरीदा जा सकता है, लेकिन उनकी मूल्यांकन वाणिज्यिक दिन के लिए नहीं किया जाता है।\n" +
                        "\n5. अन्य बॉन्ड: इसमें मुद्रा बॉन्ड, निगम बॉन्ड, और गोल्ड बॉन्ड शामिल हैं।\n" +
                        "\nइन बॉन्ड के प्रकारों में कुछ अंतर हो सकते हैं, लेकिन उन सभी का मुख्य उद्देश्य निवेशकों को नियमित ब्याज और निवेश के लिए स्थ",
                imgUrl = "https://media.istockphoto.com/id/1282186968/vector/woman-invests-in-bonds-receive-coupons-concept-of-return-on-investment-financial-solutions.jpg?s=612x612&w=0&k=20&c=ufjm9HW8tsV2gqGtkjMTlKMLC-8gOvWdDb7RVrWvTBM="
            ),
            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_BONDS,
                title = "निवेशकों के लिए बॉन्ड की महत्वपूर्णता",
                description = "बॉन्ड निवेश एक महत्वपूर्ण वित्तीय योजना है जो निवेशकों को अपनी निवेश योजना में विवेकपूर्णता और संतोष प्रदान करती है। कुछ महत्वपूर्ण लाभ निम्नलिखित हैं:\n" +
                        "\n1. नियमित आय: बॉन्डों से मिलने वाला ब्याज निवेशकों को नियमित आय प्रदान करता है।\n" +
                        "\n2. स्थिरता: बॉन्ड निवेश निवेशकों को स्थिरता प्रदान करता है क्योंकि इसमें निर्धारित ब्याज दर होती है।\n" +
                        "\n3. निवेश पोर्टफोलियो का संतुलन: बॉन्ड निवेश निवेशकों के पोर्टफोलियो को संतुलित करता है और उन्हें आय के स्रोत का एक स्थिर स्त्रोत प्रदान करता है।",
                imgUrl = "https://media.istockphoto.com/id/1282186968/vector/woman-invests-in-bonds-receive-coupons-concept-of-return-on-investment-financial-solutions.jpg?s=612x612&w=0&k=20&c=ufjm9HW8tsV2gqGtkjMTlKMLC-8gOvWdDb7RVrWvTBM="
            )
        )
    }
}
