package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Commodity {

    fun getCommodityList(): List<ModelSubTopic>{
        return listOf(
            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "Commodity Market क्या है?",
                description = "कमोडि टी बाजार (Commodity Market) एक ऐसा बाजार है जहां विभिन्न प्रकार की कमोडिटी जैसे कि गहुं, चावल, धान, धातु, तेल, गैस, अनाज, और अन्य उत्पादों का व्यापार होता है। यहां कमोडि टी की व्यापारि क मानक मात्रा (जैसे कि लॉट या एक नि श्चि त वजन) और मूल्य नि र्धारि त होते हैं। यह बाजार उत्पादकों और उपभोक्ताओं के बीच वस्त्रित खरीद और बिक्रीकी अवधारणा पर आधारि त होता है। इसमें कुछ मुख्य तत्व होते हैं, जैसे कि कमोडि टी फ्यूचर्स, ऑप्शन्स और स्पॉट व्यापार। कमोडि टी फ्यूचर्स में, विक्रेता और खरीददार एक समय पर भविष्य की डिलीवरी की शर्तों पर एक समझौता करते हैं। कमोडि टी ऑप्शन्स में, एक पक्ष एक निश्चित मूल्य पर खरीदने या बेचने का अधि कार रखता है, लेकि न यह आवश्यकता नही होती है कि वह उत्पाद को वास्तवि क रूप से खरीदें या बेचें। कमोडि टी स्पॉट व्यापार में, वस्त्रित उत्पाद को तत्काल डि लीवरी कि या जाता है। कमोडि टी बाजार उत्पादकों को उनकी उत्पादों को बेचने का एक प्लेटफ़ॉर्म प्रदान करता है और खरीददारों को उनकी आवश्यकताओं के अनुसार उत्पादों को खरीदने का अवसर प्रदान करता है। यह बाजार उत्पादको के लि ए अच्छा है क्योकिं यह उन्हें उनके उत्पादो का बेचने का एक सुरक्षित और विश्वसनीय माध्यम प्रदान करता है, और उपभोक्ताओ के लिए अच्छा है क्योकिं यह उन्हें अच्छे गुणवत्ता वाले उत्पादो को अच्छे दामो पर प्राप्त करने का मौका देता है।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            ),

            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "Commodity के प्रकार",
                description = "Commodity निवेश के विभिन्न प्रकार होते हैं, जिन में निम्नलिित शामिल हैं:\n\n" +
                        "1. खाद्य अनाज: इसमें अनाज जैसे गेहूं, चावल, मक्का, चना, अरहर आदि शामि ल होते हैं। खाद्य अनाज की मूल्य वृद्धि या गि रावट पर प्रभावि त होती है।\n\n" +
                        "2. धातु और धातुओं के उपादान: इसमें चांदी, सोना, प्लैटि नम, कॉपर, तांबा, निकेल, आदि शामिल होते हैं। धातु के मूल्य के वि वि धता और उपयोग के कारण इसमें निवेश का मार्ग होता है।\n\n" +
                        "3. ऊर्जा उत्पाद: इसमें पेट्रलि यम, क्रूड ऑयल, नैचुरल गैस, ईलेक्ट्रिसि टी, आदि शामि ल होते हैं। ऊर्जा उत्पादों की मांग और आपूर्ति , वि पणन की चुनौति यों के साथ संबंधि त होती है।\n\n" +
                        "4. कृ षि उत्पाद: इसमें गन्ना, कपास, तिलहन, चाय, कॉफी, आदि शामि ल होते हैं। कृ षि उत्पादों की मूल्य वृद्धि या गि रावट के कारण निवेशकों के लिए विशेष रूप से महत्वपूर्ण होता है।\n\n" +
                        "5. फॉरेक्स: इसमें विभिन्न विदेशी मुद्राओं के विनि मय और वित्तीय नि वेश शामि ल होते हैं। फॉरेक्स बाजार में नि वेश गहरे विश्वासघात और तकनीकी ज्ञान की आवश्यकता के साथ कि या जाता है।\n\n" +
                        "ये थे कुछ प्रमुख Commodity नि वेश के प्रकार, जो निवेशकों को विभिन्न वित्तीय लाभ प्राप्त करने का अवसर प्रदान करते हैं।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            ),


            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "Commodity Trading में क्या अलग है?",
                description = "Commodity Trading में कई अलग विशेषताएँ होती हैं जो इसे अन्य वित्तीय निवेशों से अलग बनाती हैं। यहाँ कुछ मुख्य विशेषताएँ हैं:\n\n" +
                        "1. अन्य निवेशों की तुलना में, commodity trading में मूल्यों में अधि कतम वोलेटि लि टी होती है। इसका मतलब है कि मूल्यों में तेजी या तेजी से गिरावट हो सकती है।\n\n" +
                        "2. Commodity markets की trading hours अक्सर अन्य निवेशों की तुलना में अधिक होती हैं, क्योकिं ये अंतर्राष्टीय बाजारो  के साथ संचालित होते हैं।\n\n" +
                        "3. Commodity trading में नि वेशको  के लिए ज्यादा तकनीकी ज्ञान और वि श्वासघात की आवश्यकता होती है, क्योकिं यहाँ के मूल्यो का प्रभाव अंतरराष्टीय समस्याओं, उत्पादक देशों के कृषि से जुड़े मौसम की स्थिति , और अन्य घटनाओं से प्राप्त होता है।\n\n" +
                        "4. Commodity trading में निवेशक सामान्यत: धातु, खाद्य आदि जैसे उत्पादों में निवेश करते हैं, जबकि अन्य निवेशों में वे शेयर, म्यूचुअल फंड, और बॉन्ड में निवेश करते हैं।\n\n" +
                        "5. Commodity markets में नि वेशकों के पास कई वि कल्प होते हैं, जैसे की futures, options, और ETFs। ये विकल्प उन्हें विभिन्न तरीकों से अपने नि वेश को धारात्मक बनाने की सुविधा प्रदान करते हैं।\n\n" +
                        "इन सभी कारणों से देखा जाता है कि commodity trading अन्य नि वेशों से अलग होता है और इसमें नि वेशकों को उच्च जोखिमों और बड़े लाभों का सामना करना पड़ता है।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            ),


            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "फ्यूचर कॉन्ट्रैक्ट क्या है?",
                description = "फ्यूचर्स कॉन्ट्रैक्ट एक वित्तीय समझौता होता है जिसमें दो पक्षों के बीच एक निर्धारित मूल्य पर एक परिणाम या सामर्थ्य का समझौता होता है। " +
                        "इसका मतलब है कि एक पक्ष एक निश्चित तिथि पर एक निश्चित मूल्य पर एक निश्चित मात्रा की निवेश करने के लिए एक दूसरे पक्ष के साथ समझौता करता है। " +
                        "यह तीन प्रमुख तत्वों पर आधारित होता है: मूल्य, मात्रा और नियम। " +
                        "फ्यूचर्स कॉन्ट्रैक्ट बाजारों में व्यापारी का उपयोग में लिए जाते हैं, जैसे कि कमोडिटी, वाणिज्यिक आवश्यकताएं, और वित्तीय उपकरण। इनमें " +
                        "आधार शेयर, रियल एस्टेट, और शेयर बाजार के इंडेक्स शामिल हो सकते हैं। " +
                        "फ्यूचर्स कॉन्ट्रैक्ट का उदाहरण: सोचिए कि आप एक आदमी हैं जो जून माह में सोने का एक प्रति के 100 ग्राम के लिए फ्यूचर्स कॉन्ट्रैक्ट " +
                        "खरीदना चाहते हैं। जून माह में सोने का मूल्य 50,000 रुपये प्रति 10 ग्राम है। इसका मतलब है कि एक प्रति के 100 ग्राम के लिए आपको " +
                        "5,00,000 रुपये चुकाने होंगे। आप यह समझौता कर लेते हैं कि जून में सोने का मूल्य 55,000 रुपये प्रति 10 ग्राम होगा। इसका मतलब है कि " +
                        "जब आपका फ्यूचर्स कॉन्ट्रैक्ट समाप्त होता है, तो आपको 5,50,000 रुपये मिलेंगे। इस प्रकार, आप निश्चित मूल्य पर सोने को खरीदने के लिए " +
                        "एक समझौता कर रहे हैं, जो कि जून माह में निश्चित मात्रा में सोने के लिए अवलंबित करने का प्रतिनिधित्व करता है।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            ),


            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "Commodity Trading के फायदे",
                description = "Commodity trading के कई फायदे होते हैं। ये कुछ मुख्य फायदे हैं:\n\n" +
                        "1. विभिन्न विकल्प: Commodity market में विभिन्न तरह की commodities उपलब्ध होती हैं, जैसे कि पेट्रोल, सोना, सिल्वर, गहने, गेहूं, चावल, और कागज। इससे निवेशकों को अलग-अलग विकल्पों में निवेश करने की सुविधा मिलती है।\n\n" +
                        "2. वित्तीय विविधता: Commodity trading एक वित्तीय विविधता को बढ़ावा देता है, क्योंकि इसमें निवेशक विभिन्न संसाधनों में निवेश कर सकते हैं।\n\n" +
                        "3. फ्लेक्सिबिलिटी: Commodity trading में निवेशकों को अपने निवेश को बदलने की ज्यादा आवश्यकता नहीं होती। वे अपने निवेशों को अपनी आवश्यकताओं और लक्ष्यों के अनुसार बदल सकते हैं।\n\n" +
                        "4. हेजिंग: Commodity trading में निवेशक अपनी विपरीत लेन-देन (या हेजिंग) कर सकते हैं, जिससे वे अपने निवेश को मामूली हानि से बचा सकते हैं।\n\n" +
                        "5. लिक्विडिटी: Commodity market में लिक्विडिटी अधिक होती है, जिससे निवेशक अपने निवेश को बेचने या खरीदने में कोई समस्या नहीं आती।\n\n" +
                        "6. इंट्रेस्ट दरों का प्रभाव: Commodity market में बाजार रेट्स पर बदलाव के कारण, निवेशक अच्छे रिटर्न प्राप्त कर सकते हैं।\n\n" +
                        "इन फायदों के अलावा, commodity trading में विशेषज्ञता और विस्तृत जानकारी के साथ निवेश करने से निवेशकों को अधिक लाभ प्राप्त करने का अवसर मिलता है।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            ),


            ModelSubTopic(
                id = 6,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "Indian Commodity Exchange का क्या रोल है?",
                description = "Indian Commodity Exchange भारत में एक महत्वपूर्ण कंमोडिटी विनिमय बाजार है जो कंमोडिटी ट्रेडिंग को संचालित करता है। इसका मुख्य उद्देश्य भारतीय विनिमय बाजार में विभिन्न कंमोडिटी उत्पादों की खरीद-बिक्री को सुगम बनाना और निवेशकों को एक सुरक्षित और अच्छे रिटर्न के साथ निवेश करने का अवसर प्रदान करना है।\n\n" +
                        "Indian Commodity Exchange का काम निम्नलिखित होता है:\n\n" +
                        "1. कंमोडिटी बाजार को संचालित करना: Indian Commodity Exchange कंमोडिटी बाजार को संचालित करने के लिए आवश्यक नियमों और विनियमों को निर्धारित करता है। यहाँ कंमोडिटी बाजार प्रतियोगितात्मक, निष्पक्ष और निष्पक्ष दृष्टि कोण से संचालित होता है।\n\n" +
                        "2. विनिमय तकनीकी प्लेटफ़ॉर्म: इस एक्सचेंज ने एक उच्च स्तर का तकनीकी प्लेटफ़ॉर्म विकसित किया है जो निवेशकों को आसानी से कंमोडिटी ट्रेडिंग करने की सुविधा प्रदान करता है।\n\n" +
                        "3. निवेशकों की सुरक्षा: इसका प्रमुख उद्देश्य निवेशकों की सुरक्षा है, और उन्हें सुरक्षित और निष्पक्ष कंमोडिटी ट्रेडिंग का मार्ग प्रदान करना है।\n\n" +
                        "4. वृद्धि और विकास: Indian Commodity Exchange का उद्देश्य भारतीय कंमोडिटी बाजार को वृद्धि और विकास में मदद करना है, और निवेशकों को अच्छे रिटर्न के साथ निवेश करने का अवसर प्रदान करना है।\n\n" +
                        "इस प्रकार, Indian Commodity Exchange का मुख्य रोल भारतीय कंमोडिटी बाजार में सुरक्षित, विश्वसनीय और प्रगतिशील विनिमय को बढ़ावा देना है।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            ),


            ModelSubTopic(
                id = 7,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "MCX क्या है?",
                description = "MCX या Multi Commodity Exchange भारत का एक प्रमुख कंमोडिटी विनिमय बाजार है। यह एक अग्रणी बाजार है जो भारतीय और अंतरराष्ट्रीय कंमोडिटी विनिमय की सुविधा प्रदान करता है। MCX कंमोडिटी बाजार में विभिन्न कंमोडिटी जैसे कि गहूं, चावल, धान, सोयाबीन, चाणा, कपास, चीनी, धातु, तेल, गैस, अनाज, धान्य, ब्रेड, बिस्कुट, एनर्जी, और अग्रसर कंमोडिटी की ट्रेडिंग की जाती है। MCX ने तकनीकी उन्नति और विनिमय प्रक्रियाओं के माध्यम से भारतीय बाजार में कंमोडिटी ट्रेडिंग को आसान और अधिक सुरक्षित बनाया है। एक उदाहरण के रूप में, यदि आप गेहूं के एक फ्यूचर कॉन्ट्रैक्ट पर निवेश करना चाहते हैं, तो यह ऐसा डेवलॉपमेंट हो सकता है: आप MCX पर जाते हैं और गेहूं के लिए एक फ्यूचर कॉन्ट्रैक्ट की खोज करते हैं। आपको गेहूं के एक निर्दिष्ट मात्रा के लिए नियमित मूल्य पर खरीदने का वादा किया जाता है। यदि आप विश्वास रखते हैं कि गेहूं की कीमत बढ़ेगी, तो आप इसे बेचने का वादा कर सकते हैं। जब कीमत बढ़ती है, तो आप अपना कॉन्ट्रैक्ट बेचकर लाभ कमा सकते हैं। इस तरह, आप उच्च या निचले बाजार में निवेश करके लाभ कमा सकते हैं।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            ),


            ModelSubTopic(
                id = 8,
                topic = Constants.KEY_TOPIC_COMMODITY,
                title = "NCDX क्या है?",
                description = "NCDEX या National Commodity & Derivatives Exchange Limited भारत का एक महत्वपूर्ण कॉमोडिटी डेरिवेटिव्स एक्सचेंज है। यह भारतीय खाद्य एवं अनाज बाजार में एक प्रमुख स्थान रखता है और विभिन्न कॉमोडिटी उत्पादों के ट्रेडिंग की सुविधा प्रदान करता है। NCDEX भारत में कृषि उत्पादों, जैसे कि गेहूं, चावल, धान, सोयाबीन, चाणा, कपास, धानिया, जीरा, धानिया, और अन्य कृषि उत्पादों के लिए ट्रेडिंग की सुविधा प्रदान करता है। इसके साथ ही, NCDEX पर नॉन-कृषि उत्पादों और बुनियादी उत्पादों के लिए भी ट्रेडिंग होती है। यह बाजार किसानों, निर्यातकों, उत्पादकों, निवेशकों, और ट्रेडर्स के लिए विकल्पों की विविधता प्रदान करता है और कृषि उत्पादों के दामों में पारदर्शिता और उत्पादों के वितरण को सुधारता है।",
                imgUrl = "https://www.shutterstock.com/image-vector/commodities-price-trading-investment-agriculture-600nw-2135732231.jpg"
            )

        )
    }

}