package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Cryptocurrency {

    fun getCryptocurrencyList():List<ModelSubTopic>{
        return listOf(
            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_CRYPTO,
                title = "Cryptocurrency क्या है?",
                description = "क्रिप्टोकरेंसी (Cryptocurrency) एक डिजिटल या वर्चुअल मुद्रा है जो क्रिप्टोग्राफी (cryptography) के तकनीकों का उपयोग करके बनाई और प्रबंधित की जाती है। यह एक प्रकार की डिजिटल या वर्चुअल मुद्रा है जो किसी भी आधिकारिक संस्था या सरकार के द्वारा नियंत्रित नहीं की जाती है। क्रिप्टोकरेंसी के कुछ प्रमुख विशेषताएँ हैं:\n\n" +
                        "1. डिजिटल: क्रिप्टोकरेंसी के वल डिजिटल रूप में मौजूद होती है और किसी भी असली मुद्रा के रूप में मुद्रातंत्र नहीं किया जा सकता है। \n" +
                        "\n" +
                        "2. डिस्ट्रीब्यूटेड लेजर: क्रिप्टोकरेंसी की सूची, या ब्लॉकचेन, एक डिस्ट्रिब्यूटेड लेजर पर आधारित होती है, जिसमें सभी लेनदेन की सारी जानकारी सुरक्षित रहती है।\n" +
                        "\n" +
                        "3. अनोनिमिटी: क्रिप्टोकरेंसी लेनदेनों को अनामित रूप से संचालित करती है, जिससे उनकी पहचान करना कठिन होता है।\n" +
                        "\n" +
                        "4. डिसेंट्रलाइज़ेशन: क्रिप्टोकरेंसी को कोई भी एकल संस्था या सरकार नियंत्रित नहीं करती है, इसलिए इसे डिसेंट्रलाइज्ड माना जाता है। क्रिप्टोकरेंसी के उदाहरण में बिटकॉइन (Bitcoin), एथेरियम (Ethereum), रिपल (Ripple), लाइटकॉइन (Litecoin) और बीटीसी (Bitcoin Cash) शामिल हैं। ये सभी विभिन्न तकनीकों, उपयोग केस, और लक्ष्यों के साथ बनाई गई हैं।\n" +
                        "\n",
                imgUrl = "https://cdn.dribbble.com/userupload/3228221/file/original-d107e26d3c6f1de989a5d239d031270c.png?resize=752x"
            ),


            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_CRYPTO,
                title = "Cryptocurrency कैसे काम करती है?",
                description = "क्रिप्टोकरेंसी काम करने का मूल सिद्धांत डिस्ट्रीब्यूटेड लेजर तकनीक (Distributed Ledger Technology) पर आधारित है, जिसमें लेनदेनों की संग्रह एक डिस्ट्रीब्यूटेड और सुरक्षित तालिका में होती है। इसके बाद, यह लेनदेन नेटवर्क के सभी सदस्यों के बीच साझा किया जाता है, जिससे उनकी गणना और सत्यापन होता है। यहां क्रिप्टोकरेंसी की काम करने की मुख्य प्रक्रिया है:\n" +
                        "\n" +
                        "1. लेनदेन: जब कोई व्यक्ति क्रिप्टोकरेंसी का लेनदेन करता है, उस लेनदेन का रिकॉर्ड ब्लॉकचेन में शामिल किया जाता है। यह लेनदेन एक प्रकार के कंप्यूटर प्रोग्राम के रूप में होता है, जिसे व्यवस्थापकों (माइनर्स) द्वारा सत्यापित किया जाता है।\n" +
                        "\n" +
                        "2. सत्यापन: लेनदेन को सत्यापित करने के लिए, माइनर्स कंप्यूटर कोड का उपयोग करके गणना करते हैं। यह गणना गूगल की क्रिप्टोग्राफिक हैश तकनीक का उपयोग करके किया जाता है। जब एक लेनदेन का हैश बनाया जाता है, तो वह लेनदेन ब्लॉकचेन में शामिल किया जाता है।\n" +
                        "\n" +
                        "3. ब्लॉकचेन में शामिलीकरण: सत्यापित लेनदेन के हैश के साथ, एक नया ब्लॉक ब्लॉकचेन में जोड़ा जाता है। इस प्रक्रिया को व्यवस्थापकों को इंसेंटिव के रूप में ब्लॉकरिवॉर्ड मिलता है, जिसमें क्रिप्टोकरेंसी की एक निर्धारित मात्रा शामिल होती है।\n" +
                        "\n" +
                        "4. साझेदारी: इस प्रक्रिया के बाद, लेनदेन को व्यवस्थापकों द्वारा ब्लॉकचेन के सभी सदस्यों के साथ साझा किया जाता है, जिससे प्रत्येक व्यक्ति का लेनदेन की सत्यापन करने का अधिकार होता है। इस प्रक्रिया के माध्यम से, क्रिप्टोकरेंसी का लेनदेन होता है और सुरक्षित तरीके से प्रत्येक लेनदेन की प्रमाणित जानकारी सुरक्षित रहती है।\n" +
                        "\n",
                imgUrl = "https://cdn.dribbble.com/userupload/3228221/file/original-d107e26d3c6f1de989a5d239d031270c.png?resize=752x"
            ),

            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_CRYPTO,
                title = "Cryptocurrency में कैसे होता है लेन-देन है?",
                description = "क्रिप्टोकरेंसी में लेन-देन का सिस्टम डिजिटल स्मार्ट कंट्रैक्ट्स (digital smart contracts) और ब्लॉकचेन तकनीक के माध्यम से काम करता है। यहाँ लेन-देन प्रक्रिया का एक साधारण उदाहरण है:\n" +
                        "\n" +
                        "1. लेनदेन का आदेश: किसी व्यक्ति द्वारा क्रिप्टोकरेंसी में लेन-देन करने के लिए एक आदेश दिया जाता है। इस आदेश में, लेनदेन की मात्रा, लेनेवाले और देनेवाले का पता, और अन्य जानकारी होती है।\n" +
                        "\n" +
                        "2. सत्यापन: यह आदेश ब्लॉकचेन नेटवर्क के सदस्यों द्वारा सत्यापित किया जाता है। इसके बाद, यह आदेश एक ब्लॉक में शामिल किया जाता है और उस ब्लॉक को ब्लॉकचेन पर संग्रहीत किया जाता है।\n" +
                        "\n" +
                        "3. ब्लॉकचेन में स्थानांतरण: जब लेनदेन का आदेश सत्यापित हो जाता है, तो लेनेवाले के खाते से उसकी क्रिप्टोकरेंसी की मात्रा कम होती है और देनेवाले के खाते में यह जमा कर दी जाती है।\n" +
                        "\n" +
                        "4. स्मार्ट कं ट्रैक्ट्स: कुछ क्रिप्टोकरेंसी में स्मार्ट कंट्रैक्ट्स का उपयोग किया जाता है, जो स्वचालित रूप से लेनदेन की प्रक्रिया को पूरा करते हैं। इन कंट्रैक्ट्स को पहले से तैयार किया जाता है और वे केवल निर्दिष्ट शर्तों पर कार्रवाई करते हैं।\n" +
                        "\n" +
                        "5. अंतिम सत्यापन: लेनदेन पूरा होने के बाद, लेनेवाले और देनेवाले के खातों में नई स्थिति की पुष्टि की जाती है और लेनदेन पूर्ण मान्य होता है।\n" +
                        "\n" +
                        "इस प्रक्रिया के माध्यम से, क्रिप्टोकरेंसी में लेन-देन होता है और प्रत्येक लेनदेन की प्रमाणित रूप से निगरानी की जाती है।",
                imgUrl = "https://cdn.dribbble.com/userupload/3228221/file/original-d107e26d3c6f1de989a5d239d031270c.png?resize=752x"
            ),

            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_CRYPTO,
                title = "Cryptocurrency के उदाहरण",
                description = "क्रिप्टोकरेंसी के कई उदाहरण हैं, जो विभिन्न तकनीकों, उद्देश्यों, और उपयोग केस के साथ विकसित की गई हैं। यहाँ कुछ प्रमुख क्रिप्टोकरेंसी के उदाहरण हैं:\n" +
                        "\n" +
                        "1. बिटकॉइन (Bitcoin): सबसे प्रसिद्ध और पुरानी क्रिप्टोकरेंसी है जो 2009 में सातोशी नाकामोतो द्वारा शुरू की गई थी। यह पहली डिजिटल मुद्रा थी जो ब्लॉकचेन तकनीक का उपयोग करके संचालित होती है।\n" +
                        "\n" +
                        "2. एथेरियम (Ethereum): एथेरियम 2015 में लॉन्च की गई और यह एक खुदरा और उच्च स्तरीय स्मार्ट कंट्रैक्ट्स प्लेटफ़ॉर्म है। इसकी मुख्य योजना डिसेंट्रलाइज़ड ऐप्लिकेशन्स (DApps) को होस्ट करने और स्मार्ट कंट्रैक्ट्स को चलाने के लिए एक संरचित विरासत कोड का विकास करना है।\n" +
                        "\n" +
                        "3. रिपल (Ripple): रिपल एक प्रमुख वित्तीय सेवा और भुगतान प्रोटोकॉल है जो वित्तीय संस्थाओं को अंतर-संसाधित और लागत कम भुगतान स्थितियों के लिए नेटवर्क करने की सुविधा प्रदान करता है।\n" +
                        "\n" +
                        "4. लाइटकॉइन (Litecoin): यह बिटकॉइन की एक विकल्पिक संस्करण है जिसका लक्ष्य और लाइटवेट और तेज लेन-देन है। लाइटकॉइन 2011 में शुरू की गई थी और समर्थित लेन-देन की संख्या में और जल्दी संचालित ट्रांजेक्शनों में बढ़ोतरी के लिए डिज़ाइन की गई थी।\n" +
                        "\n" +
                        "5. बीटीसी (Bitcoin Cash): बीटीसी बिटकॉइन की एक फोर्क है, जिसका मुख्य उद्देश्य बिटकॉइन के लेन-देन के लिए अधिक ट्रांजेक्शन क्षमता और तेजी का प्रदान करना है।\n" +
                        "\n" +
                        "ये कुछ उदाहरण हैं, हालांकि क्रिप्टोकरेंसी की बाजार में बहुत सारी अन्य मुद्राएँ भी हैं जो विभिन्न उद्देश्यों के लिए विकसित की गई हैं।",
                imgUrl = "https://cdn.dribbble.com/userupload/3228221/file/original-d107e26d3c6f1de989a5d239d031270c.png?resize=752x"
            ),

            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_CRYPTO,
                title = "Cryptocurrency में Trade कैसे करे?",
                description = "क्रिप्टोकरेंसी में व्यापार करने के लिए निम्नलिखित कदम अनुसरण किए जा सकते हैं:\n" +
                        "1. क्रिप्टोकरेंसी खाता खोलें: सबसे पहला कदम एक क्रिप्टोकरेंसी खाता खोलना है। इसके लिए आप किसी क्रिप्टो एक्सचेंज (Cryptocurrency Exchange) जैसी प्लेटफ़ॉर्म पर जा सकते हैं और अपनी पहचान की प्रमाणिती के साथ खाता खोल सकते हैं।\n" +
                        "\n" +
                        "2. धन जमा करें: अपने खाते में क्रिप्टोकरेंसी ट्रेड करने के लिए धन जमा करें। आप अकाउंट पर बैंक ट्रांसफर, क्रेडिट कार्ड, या अन्य भुगतान विकल्प का उपयोग करके धन जमा कर सकते हैं।\n" +
                        "\n" +
                        "3. विनिमय करें: एक बार जब धन जमा हो जाए, आप विभिन्न क्रिप्टोकरेंसी जैसे बिटकॉइन, एथेरियम, रिपल, आदि को खरीदने और बेचने के लिए विनिमय कर सकते हैं। आपके पास चुने गए एक्सचेंज पर ट्रेडिंग नियमों और कोशिशों का अनुसरण करें।\n" +
                        "\n" +
                        "4. सुरक्षा की देखभाल करें: क्रिप्टोकरेंसी ट्रेडिंग में सुरक्षा को महत्वपूर्ण माना जाता है। अपने खाते की सुरक्षा के लिए दो-चर आधारभूत सुरक्षा उपायों का उपयोग करें, जैसे कि दो-चर प्रमाणीकरण (two-factor authentication)।\n" +
                        "\n" +
                        "5. ट्रेडिंग रणनीति तय करें: आपको अपनी ट्रेडिंग रणनीति तय करनी चाहिए, जैसे कि निवेश का आयाम, निवेश की अवधि, और निवेश का उद्देश्य। धन नियंत्रण करें और अच्छे नियमों का पालन करें।\n" +
                        "\n" +
                        "6. अध्ययन करें और जागरूक रहें: क्रिप्टोकरेंसी बाजार में प्रतिबद्ध रहने के लिए अध्ययन करें और बाजार के विकास को ध्यान से निगरानी करें। बाजार की स्थिति और ट्रेंड का निरीक्षण करें।\n" +
                        "\n" +
                        "7. निवेश का लाभ उठाएं: अपनी ट्रेडिंग रणनीति का पालन करते हुए और बाजार की स्थिति के अनुसार निवेश करें। निवेश के माध्यम से लाभ उठाएं और अपने निवेश को सुरक्षित रखें।\n" +
                        "\n" +
                        "ध्यान दें कि क्रिप्टोकरेंसी विनिमय में अधिकांश बाजारों में जोरदार वोलेटिलिटी (volatility) होती है, इसलिए आपको सावधानी से कार्रवाई करनी चाहिए। निवेश के लिए हमेशा आपकी वित्तीय स्थिति और उद्देश्यों को ध्यान में रखें।",
                imgUrl = "https://cdn.dribbble.com/userupload/3228221/file/original-d107e26d3c6f1de989a5d239d031270c.png?resize=752x"
            )
            )
    }
}