package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Dividends {

    fun getDividendsList():List<ModelSubTopic>{

        return listOf(
            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_DIVIDENDS,
                title = "Dividend क्या होता है?",
                description = "Dividend एक प्रकार का लाभ है जो कि सी कंपनी के शेयरधारकों को दिया जाता है। जब कि सी कंपनी का लाभ मामूली होता है और उसके पास अधि क नकद धन होता है जो उसे उपयोग नहीं होता, तो वह लाभ के रूप में अपने शेयरहोल्डर्स को दे सकती है। इसे कंपनी निश्चित अंतराल पर या अचानक दे सकती है, और यह आमतौर पर प्रति शेयर की राशि के रूप में भुगतान की जाती है। यह लाभ शेयरधारकों के लिए एक अच्छा तरीका होता है ताकि उन्हें अपने निवेश का उत्तरदायित्व संभालने का अवसर मिल सके। जब कंपनी लाभ को अपने शेयरधारकों को देती है, तो वह अपने सदस्यों के साथ साझा करती है कि उन्हें कंपनी का हिस्सा है और उनका सहयोग मूलभूत रूप से महत्वपूर्ण है। इसके अलावा, यह एक प्रकार की आत्म-प्रतिष्ठा का उत्तराधिकारी होता है, जो उसके अच्छे कार्य को पुष्टि करता है और निवेशकों को आत्म-विश्वास दिलाता है। वारेन बफे, दुनिया के सबसे अमीर आदमी में से एक, अपने निवेश में भारी डिविडेंड प्राप्त किए हैं। बफे की कंपनी Berkshire Hathaway ने कई सालों से किसी भी डिविडेंड को नहीं दिया है। बफे की धारणा रहती है कि कंपनियों को लाभ को पुनर्निवेशित करना चाहिए, ताकि वह अधिक से अधिक धन प्राप्त कर सकें। लेकिन, बफे के निवेश में Berkshire Hathaway ने कई अन्य कंपनियों के डिविडेंड से भारी लाभ प्राप्त किया है, जो उन्हें एक उदाहरण प्रदान करते हैं कि डिविडेंड निवेशकों के लिए कितना महत्वपूर्ण हो सकता है। इन निवेशों का विश्लेषण करते समय, बफे ने अनेक सैंकड़ों करोड़ डॉलर के डिविडेंड प्राप्त किए हैं।",
                imgUrl = "https://cdn-scripbox-wordpress.scripbox.com/wp-content/uploads/2021/03/dividend-payout-vector.png"
            ),


            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_DIVIDENDS,
                title = "Dividend सम्बंधित कुछ महत्त्वपूर्ण",
                description = "1. कैसे पता करें कि सी कंपनी ने डिविडेंड घोषित किया है?\n• किसी कंपनी के निर्दिष्ट निवेशकों को डिविडेंड भुगतान की जानकारी उन्हें पत्र, ईमेल, या कंपनी की वेबसाइट के माध्यम से प्राप्त होती है।\n\n" +
                        "2. डिविडेंड के प्रकार क्या होते हैं?\n• डिविडेंड के प्रकार शामिल होते हैं: नकद डिविडेंड, विशेष डिविडेंड, अतिरिक्त डिविडेंड, और नवीनीकृत डिविडेंड।\n\n" +
                        "3. डिविडेंड के लिए निवेश करने के फायदे क्या होते हैं?\n• डिविडेंड के लिए निवेश करने के फायदे में निवेशकों को निरंतर निर्धारित राशि मिलती रहती है, और वे निवेश के साथ-साथ लाभ को भी प्राप्त करते रहते हैं।\n\n" +
                        "4. डिविडेंड रिइन्वेस्टमेंट क्या है?\n• डिविडेंड रिइन्वेस्टमेंट एक प्रक्रिया है जिसमें निवेशक डिविडेंड की राशि को फिर से कंपनी के निवेश में लगाता है, इसके बजाय कि उसे नकद में प्राप्त करें। यह निवेशकों को अधिक निवेश करने का मौका देता है और उनकी निवेश संपत्ति को बढ़ावा देता है।",
                imgUrl = "https://cdn-scripbox-wordpress.scripbox.com/wp-content/uploads/2021/03/dividend-payout-vector.png"
            ),
            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_DIVIDENDS,
                title = "वेशक Dividend देने वाले स्टॉक में निवेश क्यों करते हैं?",
                description = "निवेशक Dividend देने वाले स्टॉक में निवेश करते हैं क्योंकि डिविडेंड देने वाले स्टॉक्स में निवेश करने का मतलब है कि आप एक विशेष समयावधि में निरंतर रूप से निर्धारित धन का लाभ उठा सकते हैं। यह निवेश आपको नियमित अंतराल में आय देता है, जो आपके निवेश को स्थिर और सुरक्षित बनाए रखता है। इसके साथ ही, डिविडेंड देने वाले स्टॉक्स में निवेश करने से आपको वित्तीय स्थिरता और अत्यधिक प्रभावी प्रबंधन के संकेत मिलते हैं। यह आपको आत्मविश्वास देता है कि आपका निवेश अच्छी तरह से संचालित हो रहा है। इसके अलावा, डिविडेंड आपको अतिरिक्त आय भी प्रदान करते हैं, जो आपके निवेश को मजबूत बनाए रखता है।",
                imgUrl = "https://cdn-scripbox-wordpress.scripbox.com/wp-content/uploads/2021/03/dividend-payout-vector.png"
            ),


            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_DIVIDENDS,
                title = "कौनसी कंपनियाँ Dividend देती हैं?",
                description = "डिविडेंड देने वाली कंपनियों को विभिन्न सेक्टरों में पाया जा सकता है। कुछ उदाहरण निम्नलिखित हैं:\n\n" +
                        "1. बैंकिंग कंपनियाँ: बैंकिंग कंपनियाँ जैसे HDFC Bank, State Bank of India (SBI), ICICI Bank जैसी अधिकांश बैंकिंग कंपनियाँ नियमित रूप से डिविडेंड देती हैं।\n\n" +
                        "2. उत्पादन कंपनियाँ: उत्पादन क्षेत्र में कंपनियाँ जैसे ITC (ITC), नेस्ले, बॉम्बे डाइंग जैसी कंपनियाँ भी डिविडेंड देती हैं।\n\n" +
                        "3. उपकरण कंपनियाँ: उपकरण उत्पादक कंपनियाँ भी डिविडेंड देती हैं, जैसे भारतीय ऑयल कॉर्पोरेशन (IOC), भारतीय पेट्रोलियम (BPCL)।\n\n" +
                        "4. आईसीटी कंपनियाँ: आईसीटी कंपनियाँ जैसे विप्रो, टाटा कंसल्टेंसी सर्विसेज (TCS), इंफोसिस भी डिविडेंड देती हैं।\n\n" +
                        "5. फाइनेंस कंपनियाँ: फाइनेंस कंपनियाँ जैसे बजाज फाइनेंस, HDFC, महिंद्रा फाइनेंस भी डिविडेंड देती हैं।\n\n" +
                        "यह केवल कुछ उदाहरण हैं, और इस सूची में और कंपनियाँ शामिल हो सकती हैं जो नियमित रूप से डिविडेंड देती हैं। डिविडेंड देने वाली कंपनियों को निवेशकों के लिए आकर्षक बनाने का कारण यह हो सकता है कि वे नियमित रूप से निष्कलंक लाभ को निवेशकों के साथ बाँटती हैं। यह निवेशकों को निवेश करने के प्रति प्रोत्साहित करता है।",
                imgUrl = "https://cdn-scripbox-wordpress.scripbox.com/wp-content/uploads/2021/03/dividend-payout-vector.png"
            ),

            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_DIVIDENDS,
                title = "Dividend के फायदे और नुकसान",
                description = "Dividend के फायदे:\n\n" +
                        "1. नियमित आय: Dividend नियमित आय का स्रोत होते हैं जो निवेशकों को नियमित लाभ प्रदान करता है।\n\n" +
                        "2. लाभांश का भुगतान: कंपनी अपने निष्कर्ष का एक हिस्सा Dividend के रूप में निकाल सकती है, जिससे निवेशकों को कंपनी की सफलता का सीधा लाभ मिलता है।\n\n" +
                        "3. अतिरिक्त आय: Dividend को दो तरह से प्राप्त किया जा सकता है - निवेशक डिविडेंड को पुन: निवेश कर सकते हैं या इसे अपनी आवश्यकताओं के लिए उपयोग कर सकते हैं।\n\n" +
                        "4. भविष्य की आर्थिक सुरक्षा: Dividend निवेशकों को समृद्धि की दिशा में मदद करते हैं और उन्हें आर्थिक सुरक्षा प्रदान करते हैं।\n\n" +
                        "Dividend के नुकसान:\n\n" +
                        "1. कम निवेश की क्षमता: कुछ कंपनियाँ अधिक Dividend नहीं देतीं हैं, जिससे निवेशकों को निवेश करने के लिए कम पैसे बचते हैं।\n\n" +
                        "2. कंपनी की आर्थिक स्थिरता: कई बार कंपनियों को Dividend के लिए पर्याप्त पूंजी नहीं होती, जिससे उन्हें निर्णय लेना पड़ता है कि कितना Dividend दिया जाएगा। यह किसी कंपनी की आर्थिक स्थिरता पर प्रभाव डाल सकता है।\n\n" +
                        "3. निवेश की अनिश्चितता: Dividend को अनिश्चित रूप से दिया जाता है, इसलिए यह निवेशकों के लिए अनिश्चितता का कारण बन सकता है।\n\n" +
                        "4. करोंका प्रभाव: कुछ देशों में Dividend पर कर लगता है, जिससे निवेशकों को अधिक करों का सामना करना पड़ सकता है।",
                imgUrl = "https://cdn-scripbox-wordpress.scripbox.com/wp-content/uploads/2021/03/dividend-payout-vector.png"
            )

            )

    }

}