package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object ETF {

    fun getEFTList(): List<ModelSubTopic>{
        return listOf(

            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_ETF,
                title = "ETF क्या है?",
                description = "ईटीएफ (Exchange-Traded Fund) एक प्रकार का म्यूचुअल फंड होता है जो कि विशेष शेयर बाजार में ट्रेड किया जाता है। यह एक संग्रहीत निवेश होता है जो विभिन्न प्रकार के एसेट्स को शामिल करता है, जैसे कि शेयर, बॉन्ड, निवेश के फंड आदि। ईटीएफ की एक मुख्य विशेषता यह है कि इसे बाजार के उचित समय में खरीदा और बेचा जा सकता है, और इसकी कीमत निर्धारित शेयर बाजार के नियमों के अनुसार परिवर्तित होती है।\n\n" +
                        "उदाहरण के रूप में, सोचिए एक ETF जो Nifty 50 इंडेक्स को ट्रैक करता है। यदि निवेशक इस ETF में निवेश करता है, तो वह वास्तव में Nifty 50 इंडेक्स के साथ निवेश कर रहा है। जब Nifty 50 में शामिल किए गए सारे शेयरों का मूल्य बदलता है, तो ETF का मूल्य भी उसी तरह से बदलता है। इसका अर्थ है कि यदि Nifty 50 में शामिल किए गए शेयरों का मूल्य बढ़ता है, तो ETF का मूल्य भी बढ़ेगा, और यदि शेयरों का मूल्य घटता है, तो ETF का मूल्य भी गिरेगा। इसे निवेशकों को एक साथ बहुत सारे शेयरों में निवेश करने का आसान तरीका प्रदान किया जाता है, और उन्हें विभिन्न कंपनियों के अनुपातित निवेश करने की जरूरत नहीं होती।",
                imgUrl = "https://media.istockphoto.com/id/1316247835/vector/etf-index-fund-or-mutual-fund-alternative-concept-businessman-investor-holding-or-balance.jpg?s=612x612&w=0&k=20&c=oSx0EaD-4cbGGIdH1QJi-enjgRjxkm10Iz87v53LPuU="
            ),

            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_ETF,
                title = "ETF के कितने प्रकार है?",
                description = "ईटीएफ (ETF) के कई प्रकार होते हैं, जिनमें से कुछ मुख्य हैं:\n\n" +
                        "1. Equity ETFs: ये उन ETFs को दर्शाते हैं जो शेयरों या इक्विटी संबंधित निवेशों में निवेश करते हैं। उदाहरण के लिए, Nifty ETF एक ऐसा ईटीएफ है जो Nifty 50 या अन्य इंडेक्स के साथ संबंधित होता है।\n\n" +
                        "2. Debt ETFs: ये उन ETFs को दर्शाते हैं जो बॉन्ड या ऋण संबंधित निवेशों में निवेश करते हैं।\n\n" +
                        "3. Commodity ETFs: ये उन ETFs को दर्शाते हैं जो कमोडिटीज़ (सोना, चांदी, कृषि उत्पादों, पेट्रोलियम, आदि) में निवेश करते हैं।\n\n" +
                        "4. Sectoral ETFs: ये उन ETFs को दर्शाते हैं जो कि विशेष क्षेत्र में निवेश करते हैं, जैसे बैंक, ऑटोमोबाइल, इन्फ्रास्ट्रक्चर, आदि।\n\n" +
                        "5. International ETFs: ये उन ETFs को दर्शाते हैं जो विदेशी बाजारों में निवेश करते हैं, जैसे S&P 500 ETF जो संयुक्त राज्य अमेरिका के बाजार को दर्शाता है।\n\n" +
                        "6. Inverse ETFs: ये उन ETFs को दर्शाते हैं जो बाजार के प्रति कूल गतिविधि को प्रतिष्ठान करने के लिए बनाए जाते हैं। यानी जब बाजार कमजोर हो, तो इन ETFs की मूल्य बढ़ती है।\n\n" +
                        "ये कुछ प्रमुख ETF के प्रकार हैं, हालांकि और भी विभिन्न प्रकार के ETFs हो सकते हैं जो विभिन्न निवेश संवर्धन के लक्ष्यों को पूरा करने के लिए बनाए जाते हैं।",
                imgUrl = "https://media.istockphoto.com/id/1316247835/vector/etf-index-fund-or-mutual-fund-alternative-concept-businessman-investor-holding-or-balance.jpg?s=612x612&w=0&k=20&c=oSx0EaD-4cbGGIdH1QJi-enjgRjxkm10Iz87v53LPuU="
            ),


            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_ETF,
                title = "ETF कैसे काम करता है?",
                description = "ETF (Exchange Traded Fund) एक निवेश उपकरण है जो बाजार में ट्रेड होता है और जिसे सामान्यत: इंडेक्स फंड के रूप में जाना जाता है। ये एक निवेश तंत्र होता है जो कि सीमित इंडेक्स के शेयरों को ट्रैक करता है। जब आप एक ETF खरीदते हैं, तो आप वास्तव में उस इंडेक्स के हिस्सेदार बन जाते हैं। यहाँ कुछ महत्वपूर्ण चरणों को देखा जा सकता है जो ETF कैसे काम करता है:\n\n" +
                        "1. संग्रहण (Creation): एक ETF की शुरुआती निवेश की प्रक्रिया को \"संग्रहण\" कहा जाता है। एक ETF की संग्रहण को बाजार मेकर के द्वारा किया जाता है, जो इसे प्रारंभिक निवेशकों के लिए उपलब्ध कराता है।\n\n" +
                        "2. निर्धारित इंडेक्स फंड: ETF की मूल विशेषता यह है कि यह कि सीमित इंडेक्स के शेयरों को ट्रैक करता है। जैसे कि Nifty 50, Sensex, या कि सी अन्य सांकेतिक इंडेक्स के शेयरों का ट्रैक किया जा सकता है।\n\n" +
                        "3. निगमन (Redemption): जब एक निवेशक अपने ETF इकाइयों को बेचता है, तो यह \"निगमन\" के रूप में जाना जाता है। निगमन की प्रक्रिया में, निवेशक अपने यूनिट्स को ETF की निगमन समिति के पास लौटाता है और उन्हें उसकी निवेश मूल्य के अनुसार नकद प्राप्त करता है।\n\n" +
                        "4. ट्रेडिंग: ETF के यूनिट्स बाजार में प्रत्येक व्यापारिक दिन के दौरान ट्रेड होते हैं, जैसे कि एक शेयर के रूप में। इससे निवेशकों को एक नियमित और स्थिर लिक्विडिटी की सुविधा मिलती है।\n\n" +
                        "इस प्रकार, एक ETF उन्हें निवेशकों को इंडेक्स के हिस्सेदार बनाता है जो उसमें शामिल होते हैं, जो इसे एक विशेष इंडेक्स के अनुसार दिया गया होता है। यह निवेशकों को बाजार में विभिन्न सेक्टरों या उद्योगों में निवेश करने की अनुमति देता है और उन्हें एक माध्यम देता है अपने निवेशों को विस्तृत करने के लिए।",
                imgUrl = "https://media.istockphoto.com/id/1316247835/vector/etf-index-fund-or-mutual-fund-alternative-concept-businessman-investor-holding-or-balance.jpg?s=612x612&w=0&k=20&c=oSx0EaD-4cbGGIdH1QJi-enjgRjxkm10Iz87v53LPuU="
            ),


            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_ETF,
                title = "ETF कैसे ख़रीदे?",
                description = "ईटीएफ को भारतीय बाजार में खरीदने के लिए निम्नलिखित चरणों का पालन किया जा सकता है:\n\n" +
                        "1. ब्रोकर का चयन करें: सबसे पहले, एक ब्रोकर का चयन करें जिससे आप निवेश करना चाहते हैं। आप इसे ऑनलाइन या ऑफलाइन दोनों तरीकों से कर सकते हैं।\n\n" +
                        "2. ट्रेडिंग अकाउंट खोलें: अपने चयनित ब्रोकर के साथ एक ट्रेडिंग अकाउंट खोलें। इसके लिए आपको कुछ आवश्यक दस्तावेजों की आवश्यकता हो सकती है।\n\n" +
                        "3. ट्रेडिंग अकाउंट में धन जमा करें: अपने ट्रेडिंग अकाउंट में धन जमा करें जिसका उपयोग आप ईटीएफ खरीदने के लिए करेंगे।\n\n" +
                        "4. ईटीएफ चयन करें: अपने ब्रोकर के वेबसाइट या ऐप के माध्यम से उपलब्ध ईटीएफ की सूची देखें और अपनी आवश्यकताओं और लक्ष्यों के अनुसार एक या एक से अधिक ईटीएफ का चयन करें।\n\n" +
                        "5. आर्डर दें: चयनित ईटीएफ के लिए आर्डर दें। आप आदर्श दर (निकटतम मूल्य) पर खरीदने का आदेश दे सकते हैं या तो आर्डर मार्केट (वर्तमान मूल्य) द्वारा खरीद सकते हैं।\n\n" +
                        "6. दस्तावेज़ प्रस्तुत करें: आपके ब्रोकर द्वारा अनुरोध की गई जानकारी और दस्तावेज़ प्रस्तुत करें। इसमें आपकी पहचान के प्रमाण (KYC), बैंक खाता विवरण आदि शामिल हो सकते हैं।\n\n" +
                        "7. ईटीएफ खरीदें: आपके द्वारा दी गई आर्डर के अनुसार, आपका ईटीएफ खरीदा जाएगा और आपके ट्रेडिंग अकाउंट में यह जमा किया जाएगा।\n\n" +
                        "8. निवेश की निगरानी: आप अपने निवेश की प्रगति को निगरानी कर सकते हैं और जरूरत के अनुसार अपने निवेश में बदलाव कर सकते हैं।\n\n" +
                        "ध्यान दें कि ये स्टेप्स सामान्य रूप से होते हैं, लेकिन प्रत्येक ब्रोकर की नियमों और प्रक्रियाओं में थोड़ी भिन्नता हो सकती है।",
                imgUrl = "https://media.istockphoto.com/id/1316247835/vector/etf-index-fund-or-mutual-fund-alternative-concept-businessman-investor-holding-or-balance.jpg?s=612x612&w=0&k=20&c=oSx0EaD-4cbGGIdH1QJi-enjgRjxkm10Iz87v53LPuU="
            )
            )
    }

}