package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Inflation {

    fun getInflationList():List<ModelSubTopic>{
        return listOf(

            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_INFLATION,
                title = "(Inflation) क्या है?",
                description = "मुद्रास्फीति या इन्फ्लेशन (Inflation) एक अर्थशास्त्रीय शब्द है जो उस मूल्य स्तर को दर्शाता है जिसमें सामानों और सेवाओं की मूल्यांकन में एक स्थायी और स्थिर वृद्धि होती है। इसका मतलब है कि जब एक देश की मुद्रास्फीति बढ़ती है, तो एक वस्त्र, सेवा या सामान की मूल्य उसकी दर कम होती है। इसका परिणाम होता है कि एक व्यक्ति को उसी मौजूदा धनराशि के लिए कम वस्त्र, सेवाओं या सामान की मिलती है।\n\nइसे उदाहरण के रूप में समझने के लिए, सोचिए कि आप एक स्वादिष्ट पिज़्ज़ा खाने जा रहे हैं जिसका मूल्य पिछले महीने में 100 रुपये था। अब आप वही पिज़्ज़ा खरीदने के लिए जाते हैं, लेकिन अब उसकी कीमत 120 रुपये हो गई है। इसे मुद्रास्फीति कहा जाता है, जिसका मतलब है कि आपको पिज़्ज़ा की एक इकाई के लिए अब अधिक पैसे देने की आवश्यकता हो गई है।",
                imgUrl = "https://media.istockphoto.com/id/1400001514/vector/food-and-price-inflation-rises-after-monetary-value-growth-ideas-financial-problems-and.jpg?s=612x612&w=0&k=20&c=jPlvH-V6VEb88YWot1Ou4ggq4ZFPH9ugm4RhtRaWRNM="
            ),


            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_INFLATION,
                title = "Inflation की मुख्य बातें",
                description = "इन्फ्लेशन (Inflation) की कुछ मुख्य बातें निम्नलिखित हैं:\n\n" +
                        "1. मूल्य स्तर में वृद्धि: इन्फ्लेशन का सीधा परिणाम है कि सामान और सेवाओं की मूल्यांकन में वृद्धि होती है। इससे लोगों को उनकी खरीदारी के लिए अधिक पैसे चाहिए होते हैं।\n\n" +
                        "2. धनराशि की कमी: अगर इन्फ्लेशन की दर अधिक हो, तो व्यक्तिगत और संगठित धनराशि की मान्यता घट सकती है। इसका कारण हो सकता है कि एक संदर्भ में कम पैसे अब कम मूल्यवर्धन के लिए प्रभावी हो सकते हैं।\n\n" +
                        "3. विनिवेश: इन्फ्लेशन के कारण पैसे की कमी होती है और इसलिए लोगों को पैसे को बचाने के लिए और उनकी मौजूदा धनराशि को संरक्षित रखने के लिए विनिवेश की आवश्यकता होती है।\n\n" +
                        "4. अर्थव्यवस्था पर प्रभाव: अधिक इन्फ्लेशन की स्तर के लिए सामान्य बात है कि उसका अर्थव्यवस्था पर नकारात्मक प्रभाव होता है। यह उत्पादन, रोजगार, और आम जीवन में आर्थिक स्थिरता पर असर डाल सकता है।\n\n" +
                        "5. सामाजिक और राजनीतिक अस्थिरता: अधिक इन्फ्लेशन भी सामाजिक और राजनीतिक अस्थिरता बढ़ा सकता है, क्योंकि इससे जनमानस की स्थिति पर बुरा असर पड़ सकता है। धर्मघात, आंदोलन, और असहयोगता इसके साथ आ सकती हैं।",
                imgUrl = "https://media.istockphoto.com/id/1400001514/vector/food-and-price-inflation-rises-after-monetary-value-growth-ideas-financial-problems-and.jpg?s=612x612&w=0&k=20&c=jPlvH-V6VEb88YWot1Ou4ggq4ZFPH9ugm4RhtRaWRNM="
            ),


            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_INFLATION,
                title = "Inflation का प्रभाव",
                description = "इन्फ्लेशन (Inflation) का प्रभाव विभिन्न तरीकों में दिखाई देता है:\n\n" +
                        "1. उत्पादन की कमी: इन्फ्लेशन के बढ़ने से कंपनियों को उत्पादन के लिए अधिक खर्च करने की आवश्यकता होती है, जो उनकी लाभांश को कम कर सकती है।\n\n" +
                        "2. स्टॉक मार्केट पर प्रभाव: इन्फ्लेशन के कारण बाजार में वोलेटिलिटी बढ़ सकती है, जिससे निवेशकों के निवेश पर असर पड़ सकता है।\n\n" +
                        "3. धनराशि की कमी: इन्फ्लेशन के कारण धनराशि की कीमत कम हो सकती है, जिससे लोगों की खरीदारी की शक्ति कम होती है।\n\n" +
                        "4. ब्याज दरों पर प्रभाव: इन्फ्लेशन के बढ़ने से ब्याज दरें भी बढ़ सकती हैं, जो उच्च कार्यक्षमता वाले उत्पादों की खरीदारी को प्रभावित कर सकता है।\n\n" +
                        "5. मूल्यांकन में परिवर्तन: इन्फ्लेशन के कारण मूल्यांकन में बदलाव आता है, जिससे लोगों को उनकी जीवन योजना के अनुसार वित्तीय योजनाओं में बदलाव करना पड़ सकता है।",
                imgUrl = "https://media.istockphoto.com/id/1400001514/vector/food-and-price-inflation-rises-after-monetary-value-growth-ideas-financial-problems-and.jpg?s=612x612&w=0&k=20&c=jPlvH-V6VEb88YWot1Ou4ggq4ZFPH9ugm4RhtRaWRNM="
            ),


            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_INFLATION,
                title = "Inflation के कारण",
                description = "Inflation के कुछ मुख्य कारण हैं:\n\n" +
                        "1. मूल्य में वृद्धि: यह एक प्रमुख कारण है जब मूल्यों में बढ़ोतरी होती है, जो सामानों और सेवाओं की मांग के अधिक होने के कारण हो सकती है।\n\n" +
                        "2. अधिक शेष पैसे की चपेट में बढ़ोतरी: अगर अधिक शेष पैसे में बढ़ोतरी होती है, तो लोग अधिक खर्च करने के लिए तत्पर होते हैं, जो मूल्यों को ऊपर ले जाता है।\n\n" +
                        "3. वित्तीय नीति: रिज़र्व बैंक और सरकार की नीतियों में बदलाव भी इसका कारण बन सकता है, जैसे कि ब्याज दरों में परिवर्तन या मुद्रा के अधिकतम उत्पादक में कटौती।\n\n" +
                        "4. वित्तीय बाज़ार में परिवर्तन: सामाजिक और राजनीतिक घटनाओं, प्राकृतिक आपदाओं, और विश्व व्यापार में परिवर्तन भी मूल्य में वृद्धि का कारण बन सकते हैं।\n\n" +
                        "5. व्यापारिक उत्पादों की मांग और परिमाण: किसी विशेष सामग्री या सेवा की मांग या उपलब्धता में परिवर्तन, उत्पाद की वास्तविक लागत पर अधिक दबाव डाल सकता है, जो मूल्यों को बढ़ा सकता है।",
                imgUrl = "https://media.istockphoto.com/id/1400001514/vector/food-and-price-inflation-rises-after-monetary-value-growth-ideas-financial-problems-and.jpg?s=612x612&w=0&k=20&c=jPlvH-V6VEb88YWot1Ou4ggq4ZFPH9ugm4RhtRaWRNM="
            ),

            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_INFLATION,
                title = "Inflation की गणना कैसे होती है?",
                description = "Inflation की गणना करने के लिए विभिन्न माध्यम होते हैं, लेकिन सबसे सामान्य तरीका CPI या Consumer Price Index का उपयोग करके होता है। यह निम्नलिखित चरणों में किया जाता है:\n\n" +
                        "1. समर्पित सामान का चयन: इस प्रक्रिया में, विशिष्ट सामग्री या सेवा के लिए एक समर्पित ग्राहक समूह का चयन किया जाता है। इस ग्राहक समूह को \"संख्यात्मक प्रतिनिधित्व\" कहा जाता है।\n\n" +
                        "2. मूल्यों का संग्रह: चयनित सामान की मूल्यों को एक स्थिर अवधि के दौरान निर्धारित किया जाता है।\n\n" +
                        "3. मूल्यों की गणना: इस दौरान, गणना एजेंसी CPI के मूल्य बॉस्केट के आधार पर मूल्यों का औसत लेती है। यह सामान्यतः बेहद साधारण और महत्वपूर्ण उपयोग में प्रयुक्त सामग्री की मूल्यों को शामिल करता है, जैसे खाद्य, वस्त्र, आवास आदि।\n\n" +
                        "4. गणना का तुलनात्मक स्थानांतरण: अब, वर्तमान मूल्यों को आधुनिक वार्षिक औसत के साथ तुलना करते हुए पिछले वर्ष की औसत के साथ तुलना किया जाता है।\n\n" +
                        "5. गणना का नतीजा: इन सभी प्रक्रियाओं के बाद, गणना एजेंसी नए CPI के संचयी अंक को पिछले साल के संचयी अंक के साथ तुलना करती है और इसे इन्फ्लेशन दर के रूप में प्रस्तुत करती है।",
                imgUrl = "https://media.istockphoto.com/id/1400001514/vector/food-and-price-inflation-rises-after-monetary-value-growth-ideas-financial-problems-and.jpg?s=612x612&w=0&k=20&c=jPlvH-V6VEb88YWot1Ou4ggq4ZFPH9ugm4RhtRaWRNM="
            ),


            ModelSubTopic(
                id = 6,
                topic = Constants.KEY_TOPIC_INFLATION,
                title = "Inflation को कैसे कंट्रोल किया जाता है?",
                description = "Inflation को कंट्रोल करने के लिए कई उपाय होते हैं, जिनमें से कुछ निम्नलिखित हैं:\n\n" +
                        "1. मोनेटरी नीति: रिज़र्व बैंक जैसी संचालित अर्थशास्त्रीय संस्थाएं मोनेटरी नीति के माध्यम से मौद्रिक प्रबंधन करती हैं, जिसमें ब्याज दरों को बदलकर या अन्य निर्दिष्ट उपायों का उपयोग करके धरनी की मात्रा को नियंत्रित किया जाता है।\n\n" +
                        "2. फिस्कल नीति: सरकार वित्तीय नीतियों के माध्यम से उचित वित्तीय उपायों का प्रयोग करती है, जैसे कि कर, खर्च को कम करने या सरकारी बजट को नियंत्रित करने के लिए उचित नीतियों का प्रयोग करती है।\n\n" +
                        "3. मांग और प्रसारण का संतुलन: अधिक आवश्यकता के साथ मांग को संतुलित करने के लिए विभिन्न उत्पादों और सेवाओं के लिए संभावित वृद्धि के बारे में विचार किया जाता है।\n\n" +
                        "4. मूल्यों की निगरानी: सरकार और मूल्य निगरानी संगठन द्वारा आयात और निर्यात मूल्यों की निगरानी की जाती है ताकि आम लोगों को नियमित मूल्यों में सुधार हो।\n\n" +
                        "5. बाजार सुधार: विभिन्न बाजारों की संरचना में सुधार किया जाता है ताकि संदर्भ में अधिक उत्पाद उपलब्ध हों, जिससे मूल्यों पर दबाव कम हो।\n\n" +
                        "6. राजनीतिक निर्णय: राजनीतिक और सामाजिक नीतियों के माध्यम से आवश्यकताओं और प्रतिरोध के बारे में गहन विचार किया जाता है। यह नीतियां शिक्षा, स्वास्थ्य और जलवायु परिवर्तन जैसे क्षेत्रों में लागू हो सकती हैं जो संभावित उत्पन्न कारकों पर अधिक प्रभाव डालते हैं।",
                imgUrl = "https://media.istockphoto.com/id/1400001514/vector/food-and-price-inflation-rises-after-monetary-value-growth-ideas-financial-problems-and.jpg?s=612x612&w=0&k=20&c=jPlvH-V6VEb88YWot1Ou4ggq4ZFPH9ugm4RhtRaWRNM="
            )
        )
    }

}