package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Investing {

    fun getInvestingList():List<ModelSubTopic> {
        return listOf(
            //ModelSubTopic(id = 1, topic = Constants.KEY_TOPIC_MUTUAL_FUNDS, title = "", description = "", imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp")


            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_INVESTING,
                title = "निवेश (Investment) क्या होता है?",
                description = "निवेश का अर्थ होता है पैसे या संपत्ति को ऐसे स्रोतों में लगाना जो वापसी या लाभ की संभावना रखते हैं। इसका उदाहरण यह है कि यदि कोई व्यक्ति शेयर बाजार में शेयरों में पैसे लगाता है, तो उसे उम्मीद होती है कि उसके पैसे बढ़ सकते हैं। इसी तरह, कोई व्यक्ति अच्छे बैंक डि पॉज़िट या निवेशीय धन को चुनता है, ताकि वह अपने पूंजी को सुरक्षित रख सके और साथ ही वापसी प्राप्त कर सके।\n\n" +
                        "एक उदाहरण के रूप में, एक व्यक्ति ने 50,000 रुपये को शेयर बाजार में निवेश किया। उसने इस निवेश के माध्यम से कुछ विशेष कंपनियों के शेयर खरीदे। एक साल बाद, उसके निवेश का मूल्य 60,000 रुपये हो गया। इससे उसका निवेश 10,000 रुपये महीने की आय प्राप्त करता है।\n\n" +
                        "इस उदाहरण में, निवेश करने के परिणामस्वरूप, व्यक्ति को 10,000 रुपये की आय मिली है जो उसने निवेश किए गए धन से प्राप्त की है।\n\n" +
                        "यह उदाहरण निवेश के द्वारा कैसे आय की प्राप्ति की जा सकती है को स्पष्ट करता है।",
                imgUrl = "https://static.vecteezy.com/system/resources/previews/001/944/170/non_2x/man-invests-and-made-a-profit-free-vector.jpg"
            ),


            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_INVESTING,
                title = "निवेश का उपयोग क्या है और कैसे काम करता है?",
                description = "निवेश का उपयोग यह होता है कि आप अपने पैसे को उन विकल्पों में लगाते हैं जो आपको लाभ प्राप्त करने की संभावना देते हैं। भारतीय शेयर बाजार में निवेश करने का उदाहरण यह है कि जब आप शेयरों में पैसा लगाते हैं, तो आपका मुख्य उद्देश्य होता है कि शेयर की कीमत बढ़े और आपको लाभ हो।\n\n" +
                        "उदाहरण के लिए, यदि आप 10,000 रुपये का निवेश करते हैं और एक विशिष्ट कंपनी के शेयर खरीदते हैं, तो यदि उस कंपनी के प्रदर्शन में सुधार होता है और उसकी कीमत बढ़ती है, तो आपका निवेश का मूल्य भी बढ़ जाता है। इस प्रकार, आपका निवेश आपको लाभ प्रदान करता है। लेकिन यदि कंपनी का प्रदर्शन खराब होता है और उसकी कीमत घटती है, तो आपका निवेश का मूल्य भी कम हो जाता है।\n\n" +
                        "इसलिए, निवेश के माध्यम से, आप अपने पैसे को विभिन्न विकल्पों में लगाकर उन्हें वापसी प्राप्त करने की संभावना रखते हैं।\n\n" +
                        "निवेश के कई फायदे हो सकते हैं। यहाँ कुछ मुख्य फायदे हैं:\n\n" +
                        "1. लाभांश: अगर आप सही समय पर सही निवेश करते हैं, तो आपको निवेश का लाभ प्राप्त हो सकता है। शेयर बाजार, बैंक डि पॉजिट्स, और अन्य निवेश विकल्पों में निवेश करके आप अच्छी वापसी प्राप्त कर सकते हैं।\n\n" +
                        "2. पूंजी की वृद्धि: निवेश के माध्यम से आप अपनी पूंजी की वृद्धि कर सकते हैं। निवेश के माध्यम से अपनी धनराशि को बढ़ाया जा सकता है और आपके वित्तीय लक्ष्यों को पूरा किया जा सकता है।\n\n" +
                        "3. संरक्षण: निवेश करने से आप अपनी वित्तीय स्थिति को सुरक्षित कर सकते हैं। यदि आप अपने पैसे को सही निवेश करते हैं, तो आप विपरीत परिस्थितियों के खिलाफ सुरक्षित रह सकते हैं।\n\n" +
                        "4. आय का स्थिरीकरण: निवेश करने से आप आय का स्थिरीकरण कर सकते हैं। अलग-अलग प्रकार के निवेश विकल्पों में निवेश करके, आप अपनी आय को संतुलित कर सकते हैं और अपने वित्तीय लक्ष्यों को पूरा करने में मदद कर सकते हैं।",
                imgUrl = "https://static.vecteezy.com/system/resources/previews/001/944/170/non_2x/man-invests-and-made-a-profit-free-vector.jpg"
            ),

            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_INVESTING,
                title = "निवेश के प्रकार क्या है?",
                description = "भारतीय शेयर बाजार में निवेश के कई प्रकार हैं। यहाँ कुछ प्रमुख निवेश के प्रकार और उनके साथ उदाहरण दिए गए हैं:\n\n" +
                        "1. शेयर निवेश (Stock Investment): इसमें आप किसी कंपनी के शेयर खरीदते हैं और उम्मीद करते हैं कि उनकी कीमत बढ़ेगी और आपको लाभ होगा। उदाहरण के लिए, आपने एक टेलीकॉम कंपनी के शेयर खरीदा, और जब उसकी कीमत बढ़ गई, तो आपने उसे बेचकर मुनाफा कमाया।\n\n" +
                        "2. म्यूचुअल फंड निवेश (Mutual Fund Investment): इसमें आप एक पूलिंग आवाज में निवेश करते हैं और प्रोफेशनल विशेषज्ञों के द्वारा विभिन्न संपत्तियों में निवेश किया जाता है। उदाहरण के लिए, आप एक इक्विटी म्यूचुअल फंड में निवेश कर सकते हैं, जो कंपनियों के शेयरों में निवेश करता है।\n\n" +
                        "3. कमोडिटी निवेश (Commodity Investment): इसमें आप कमोडिटी बाजार में निवेश करते हैं, जैसे कि सोना, चांदी, तांबा, अनाज आदि। आप इन कमोडिटीज में निवेश करके मुनाफा कमा सकते हैं, जब उनकी कीमतें बदलती हैं।\n\n" +
                        "4. रियल एस्टेट निवेश (Real Estate Investment): इसमें आप कृषि भूमि, अपार्टमेंट्स, व्यापारिक इमारतें, या विकसित विशेषज्ञता पर निवेश करते हैं। रियल एस्टेट में निवेश करने के लिए आप किसी एक्सपर्ट या एजेंट की मदद ले सकते हैं, और जब आप निवेश करते हैं, तो आप उसमें किराया या मूल्य के बदलाव के माध्यम से मुनाफा कमा सकते हैं।\n\n" +
                        "5. बॉन्ड निवेश (Bond Investment): इसमें आप सरकारी या निजी कंपनियों के द्वारा जारी किए गए बॉन्ड्स में पैसा लगाते हैं और ब्याज प्राप्त करते हैं।\n\n" +
                        "6. डिबेंचर निवेश (Debenture Investment): इसमें आप किसी कंपनी के द्वारा जारी किए गए डिबेंचर्स में निवेश करते हैं और उन्हें ब्याज के साथ वापस प्राप्त करते हैं। उदाहरण के लिए, आप एक वित्तीय संस्था के डिबेंचर्स में निवेश कर सकते हैं और उनसे निश्चित अवधि के बाद ब्याज प्राप्त कर सकते हैं।\n\n" +
                        "7. विपणन निवेश (Marketing Investment): इसमें आप किसी मूल्य या संपत्ति के उतार-चढ़ाव का लाभ उठाने के लिए निवेश करते हैं, जैसे कि वाणिज्यिक वस्तुएँ या इमारतें। जब मूल्य बढ़ता है, तो आप उसे बेचकर मुनाफा कमा सकते हैं।",
                imgUrl = "https://static.vecteezy.com/system/resources/previews/001/944/170/non_2x/man-invests-and-made-a-profit-free-vector.jpg"
            ),

            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_INVESTING,
                title = "आपको Invest क्यों करना चाहिए?",
                description = "निवेश के कई फायदे होते हैं, जिनमें से कुछ निम्नलिखित हैं:\n\n" +
                        "1. वित्तीय स्वतंत्रता: निवेश करके आप अपनी वित्तीय स्वतंत्रता को बढ़ाते हैं। आपके पास निवेश करने के बाद आर्थिक संबंधी निर्णयों के लिए पर्याप्त पैसा होता है।\n\n" +
                        "2. मानसिक संतुलन: निवेश करने से आपको मानसिक संतुलन मिलता है। सही निवेश आपको आत्मविश्वास देता है और आपके वित्तीय लक्ष्यों की दिशा में मदद करता है।\n\n" +
                        "3. बचत करना: निवेश करने से आप अपनी बचत कर सकते हैं, जो भविष्य में आपकी आर्थिक स्थिति को मजबूत करती है।\n\n" +
                        "4. अच्छे रिटर्न: सही निवेश करने से आपको अच्छे रिटर्न मिलते हैं, जिससे आपका पैसा अधिक से अधिक बढ़ता है।\n\n" +
                        "5. सपनों को पूरा करना: निवेश करके आप अपने सपनों को पूरा करने के लिए पैसे इकट्ठा कर सकते हैं, जैसे अपना घर खरीदना, शिक्षा का खर्चा, या अपनी पेंशन की योजना करना।",
                imgUrl = "https://static.vecteezy.com/system/resources/previews/001/944/170/non_2x/man-invests-and-made-a-profit-free-vector.jpg"
            ),


            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_INVESTING,
                title = "आपको कब Invest करना चाहिए?",
                description = "आपको निवेश करने का सही समय चुनने के लिए निम्नलिखित चीजों को ध्यान में रखना चाहिए:\n\n" +
                        "1. लक्ष्य: पहले यह निर्धारित करें कि आप निवेश करने का उद्देश्य क्या है। क्या आप लंबे समय तक इन्वेस्ट करना चाहते हैं या छोटे समय के लिए?\n\n" +
                        "2. वित्तीय स्थिति: अपनी वित्तीय स्थिति को समझें। कितने पैसे आपके पास हैं और कितना निवेश कर सकते हैं, इसे समझें।\n\n" +
                        "3. वित्तीय लक्ष्य: निवेश के लिए आपके पास क्या लक्ष्य है? घर खरीदना, शिक्षा का खर्च, या पेंशन की योजना?\n\n" +
                        "4. समय: अपने लक्ष्य के अनुसार निवेश के लिए सही समय का चयन करें। कभी-कभी बाजार में या निवेश के लिए अच्छा मौका आता है।\n\n" +
                        "5. जानकारी: निवेश के बारे में जानकारी प्राप्त करें। अच्छी तरह से अध्ययन करें और सलाह लें।\n\n" +
                        "6. सावधानी: निवेश में सावधानी बरतें। कोई भी निवेश करने से पहले अपनी वित्तीय योजना को समझें और जांचें।\n\n" +
                        "सही समय पर निवेश करना बहुत महत्वपूर्ण है। इसके लिए ध्यानपूर्वक निवेश योजना बनाएं और अपने लक्ष्य को प्राप्त करने के लिए ठीक समय पर कार्रवाई करें।",
                imgUrl = "https://static.vecteezy.com/system/resources/previews/001/944/170/non_2x/man-invests-and-made-a-profit-free-vector.jpg"
            )
        )
    }
}