package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object MutualFunds {

    fun getMutualFundsTopic():List<ModelSubTopic>{

        return listOf(
        //ModelSubTopic(id = 1, topic = Constants.KEY_TOPIC_MUTUAL_FUNDS, title = "", description = "", imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp")


            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Mutual Fund क्या है?",
                description = "म्युचुअल फंड एक तरह का निवेश है जिसमें बहुत से लोगों का पैसा एक साथ इकट्ठा किया जाता है और उस पैसे को फिर विभिन्न जगहों में निवेश किया जाता है। इसमें निवेशक अपने पैसे को किसी म्युचुअल फंड कंपनी को देते हैं और फिर कंपनी के प्रबंधकों के द्वारा विभिन्न वित्तीय उत्पादों में निवेश किया जाता है।\n\nउदाहरण के रूप में, सोचिए आपने एक म्युचुअल फंड में निवेश किया है। तो आपका पैसा उस म्युचुअल फंड कंपनी को जाता है। फिर कंपनी के प्रबंधक उस पैसे को शेयर्स, बॉन्ड्स, और अन्य वित्तीय उत्पादों में निवेश करते हैं। निवेशक फिर उस निवेश के हिसाब से लाभ प्राप्त करते हैं। इस तरह, म्युचुअल फंड निवेशकों को विभिन्न वित्तीय उत्पादों में निवेश करने का आसान तरीका प्रदान करते हैं।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Mutual Fund यूनिट क्या होता है?",
                description = "म्युचुअल फंड में निवेश करते समय, निवेशक को उस फंड की यूनिटें मिलती हैं। यह यूनिटें उनके निवेश को दर्शाती हैं, जैसे कि शेयर्स का हिस्सा। निवेशक जितने अधिक पैसे निवेश करेंगे, उतनी ही अधिक यूनिटें उन्हें मिलेंगी। जब फंड का मूल्य बढ़ता है, तो उनकी यूनिटों का मूल्य भी बढ़ता है, और जब फंड का मूल्य घटता है, तो उनकी यूनिटों का मूल्य भी घटता है। इस तरह, यूनिटें निवेशक के निवेश का प्रतिनिधित्व करती हैं और उन्हें फंड के प्राप्त लाभ का हिस्सा बनाती हैं।\n\nएक उदाहरण के रूप में, सोचिए आपने एक म्युचुअल फंड में 10,000 रुपये निवेश किए हैं और उसी फंड के मूल्य का प्रति यूनिट मूल्य 50 रुपये है। इसका मतलब है कि आपको उस फंड में 10,000 रुपये / 50 रुपये = 200 यूनिटें मिलेंगी।\n\nअब सोचिए कि फंड का मूल्य एक महीने में 55 रुपये हो गया। तो आपकी 200 यूनिटों का मूल्य अब होगा: 200 * 55 = 11,000 रुपये। इस तरह, आपका निवेश मूल्य 10,000 से 11,000 रुपये में बढ़ गया।\n\nयह उदाहरण दिखाता है कि म्युचुअल फंड में निवेश करके निवेशकों को उनके निवेश के हिसाब से यूनिटों के माध्यम से लाभ होता है।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "NAV क्या है?",
                description = "नेव (NAV) का मतलब Net Asset Value है। यह एक म्युचुअल फंड की प्रति यूनिट की वास्तविक मूल्य है। इसे मुख्य रूप से फंड के सभी निवेशों का कुल मूल्य विभाजित कर फंड के कुल यूनिटों के साथ गुणा करके प्राप्त किया जाता है।\n\nउदाहरण के लिए, सोचिए एक म्युचुअल फंड का कुल निवेशों का मूल्य 10,00,000 रुपये है और फंड के कुल 1,00,000 यूनिट हैं। तो इस फंड का नेव यूनिट प्रति कीमत 10 रुपये होगा (10,00,000 / 1,00,000)।\n\nयह उदाहरण दिखाता है कि नेव फंड की प्रति यूनिट की वास्तविक मूल्य होती है और निवेशकों को यह बताती है कि वे प्रति यूनिट कितना मूल्यवान निवेश कर रहे हैं।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "NFO या New Fund ऑफर क्या है?",
                description = "NFO या न्यू फंड ऑफ़र एक नए म्युचुअल फंड का शुभारंभ होता है। जब कोई म्युचुअल फंड कंपनी एक नया फंड लाती है, तो वह उसे NFO के रूप में प्रदर्शित करती है। इसमें निवेशकों को उस नए फंड में निवेश करने का मौका मिलता है।\n\nउदाहरण के लिए, सोचिए एक म्युचुअल फंड कंपनी ने एक नया इक्विटी फंड लॉन्च किया है। यह नया फंड आपको बाजार में उपलब्ध होने से पहले नई खबर मिलता है। फंड कंपनी द्वारा जारी किए गए NFO के माध्यम से, आप इस नए फंड में निवेश कर सकते हैं। इस प्रकार, NFO नए निवेशकों को नए फंड में निवेश का अवसर प्रदान करता है।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Mutual Fund की कैटेगरी",
                description = "म्युचुअल फंड (Mutual Fund) की दो प्रमुख कैटेगरीज होती हैं:- \n\n1. ओपन-एंडेड म्यूचुअल फंड योजना (Open-Ended Mutual Fund Scheme): यह फंड कोई निश्चित समय सीमा नहीं रखता है और निवेशक कभी भी अपने निवेश को खरीदने या बेचने के लिए उपलब्ध होता है। आप चाहे जैसे भी निवेश कर सकते हैं और अपने निवेश को किसी भी समय वापस निकाल सकते हैं।\n\n2. क्लोज़-एंडेड म्यूचुअल फंड योजना (Close-Ended Mutual Fund Scheme): इसके विपरीत, यह फंड निवेशकों के लिए एक निश्चित समय सीमा के साथ शुरू होता है और अंत में समाप्त हो जाता है। इसका निवेशकों को निवेश करने का अवसर निश्चित समय के लिए ही रहता है, फिर फंड को बंद किया जाता है और निवेशकों को उनका पैसा वापस मिलता है।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 6,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Mutual Fund के प्रकार",
                description = "भारतीय बाजार में म्यूचुअल फंड (Mutual Fund) के कई प्रकार होते हैं, जिनमें से कुछ प्रमुख प्रकार निम्नलिखित हैं:\n\n1. इक्विटी फंड (Equity Funds): इसमें निवेशकों के पैसे शेयर बाजार में निवेश किए जाते हैं। उदाहरण के रूप में, \"रिलायंस इक्विटी फंड\"।\n\n2. डेब्ट फंड (Debt Funds): इसमें निवेशकों के पैसे बॉन्ड और अन्य ऋण संरचनाओं में निवेश किए जाते हैं। उदाहरण के रूप में, \"सीआईसीआईएफ डेब्ट फंड\"।\n\n3. हाइब्रिड फंड (Hybrid Funds): यह फंड इक्विटी और डेब्ट दोनों में निवेश करते हैं। उदाहरण के रूप में, \"कोटक बैलेंस्ड फंड\"।\n\n4. लार्ज कैप फंड (Large Cap Funds): इसमें बड़ी कंपनियों के शेयरों में निवेश किया जाता है। उदाहरण के रूप में, \"एचडीएफसी टॉप 100 फंड\"।\n\n5. मिड-कैप फंड (Mid Cap Funds): यह फंड मध्यम आकार की कंपनियों के शेयरों में निवेश करते हैं। उदाहरण के रूप में, \"एसबीआई मिडकैप फंड\"।\n\n6. स्मॉल कैप फंड (Small Cap Funds): इसमें छोटी कंपनियों के शेयरों में निवेश किया जाता है। उदाहरण के रूप में, \"एमिटिक स्मॉलकैप फंड\"।\n\n7. इंटरनेशनल फंड (International Funds): यह फंड विदेशी शेयरों में निवेश करते हैं। उदाहरण के रूप में, \"मोटीलाल ओसवाल वर्ल्ड टॉप 100 फंड\"।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 7,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Equity Mutual Fund क्या है?",
                description = "इक्विटी म्यूचुअल फंड (Equity Mutual Fund) एक तरह का म्यूचुअल फंड है जो शेयर बाजार में निवेश करता है। ये फंड निवेशकों के पैसे को बड़ी कंपनियों के शेयरों में लगाते हैं। उदाहरण के रूप में, एक इक्विटी म्यूचुअल फंड जो भारतीय शेयर बाजार में निवेश करता है, वह \"सीआईसीआईएफ टॉप 100 इक्विटी फंड\" हो सकता है। इसमें निवेशकों के पैसे को भारतीय बाजार की शीर्ष 100 कंपनियों में लगाया जाता है। इस तरह के फंड में निवेशकों को बाजार के अधिकतम लाभ का लाभ उठाने की संभावना होती है।\n\nइक्विटी म्यूचुअल फंड में निवेश करने के दो प्रमुख लाभ हैं:\n\n1. लंबे समय के लिए कम कर दायिकता: यदि आप अपना निवेश एक साल से ज्यादा के लिए रखते हैं, तो आपको कोई कर नहीं देना पड़ता है।\n\n2. निवेश की स्वतंत्रता: आपको कभी भी अपने निवेश को बेच सकते हैं और उसका लाभ उठा सकते हैं।\n\nलेकिन, इसमें कुछ हानियाँ भी हैं:\n\n1. बाजार का जोखिम: इक्विटी म्यूचुअल फंड बाजार के मूल्यों में उतार-चढ़ाव के कारण जोखिमपूर्ण होता है।\n\n2. निवेश की किराया: आपको निवेश प्रबंधक को किराया देना पड़ सकता है, जो आपके लाभ को कम कर सकता है।\n\n3. शॉर्ट टर्म कैपिटल गेन्स टैक्स (STCG): यदि आप अपना निवेश एक साल से कम समय के लिए रखते हैं, तो आपको STCG टैक्स देना होगा। STCG टैक्स की दर सामान्य रूप से निवेशक की मार्जिनल इनकम के अनुसार होती है, जो सामान्य रूप से 15% होती है।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 8,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Debt Mutual Fund क्या है?",
                description = "डेब्ट म्यूचुअल फंड (Debt Mutual Fund) वित्तीय सुरक्षा और आय के लिए एक सुरक्षित निवेश का एक विकल्प होता है। इसमें निवेशक बैंक आर्थिक आवश्यकताओं के लिए लोन देने वाले विभिन्न संस्थानों जैसे सरकारी संस्थान, कॉर्पोरेट कंपनियों और बैंकों को ऋण प्रदान करते हैं। ये फंड आमतौर पर स्टेबल और सुरक्षित निवेश के रूप में जाने जाते हैं।\n\nटैक्स फायदे:\n\n1. निराधारित दर पर आय का लाभ: डेब्ट म्यूचुअल फंडों की आय पर निराधारित दर पर कर लेने की आवश्यकता नहीं होती है। यह निवेशकों को आय पर कर का बोझ नहीं डालता है और उन्हें अधिक लाभ प्राप्त करने में मदद करता है।\n\nनुकसान:\n\n1. निवेश की कम आर्थिक वृद्धि: ये फंड वित्तीय सुरक्षा के लिए होते हैं, लेकिन उनका निवेश आमतौर पर अधिक लाभ नहीं प्रदान करता है। इसलिए, वे अधिक आर्थिक वृद्धि के लिए सबसे अच्छा निवेश नहीं हो सकते हैं।\n\nउदाहरण के लिए, यदि एक व्यक्ति 5 वर्ष के लिए डेब्ट म्यूचुअल फंड में 5 लाख रुपये निवेश करता है और उसकी निवेश की वार्षिक वापसी 8% है, तो उसका 5 वर्षों में लाभ 40,000 रुपये होगा। इसमें कोई कर नहीं लगेगा अगर निवेशक 1 वर्ष से अधिक समय के लिए निवेश करता है।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 9,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Balance Mutual Fund क्या है?",
                description = "बैलेंस्ड म्यूचुअल फंड (Balance Mutual Fund) वह फंड होते हैं जो उत्तम वित्तीय स्थिति का अनुमान लगाकर अलग-अलग प्रकार के निवेश करते हैं। इसमें शेयरों और डेब्ट पेपर्स जैसे की ज्यादातर निवेश किए जाते हैं, जिससे निवेशकों को लाभ प्राप्त करने की संभावना होती है, लेकिन जोखिम कम होता है। इसमें हर प्रकार के निवेशों का मिश्रण होता है, जिससे निवेशकों को उत्तम रिटर्न प्राप्त करने के लिए सुरक्षित और स्थिर निवेश का मौका मिलता है।\n\nयह फंड जोखिम और लाभ दोनों की मद्देनजर रखते हुए निवेश करते हैं, ताकि निवेशकों को निवेश की सुरक्षा और अच्छा लाभ प्राप्त हो सके।\n\nये फंड अक्सर मध्यम या छोटे अवधि के निवेश के लिए उपयुक्त होते हैं।\n\nउदाहरण के लिए, एक बैलेंस्ड म्यूचुअल फंड शेयरों, डेब्ट पेपर्स, और कुछ सक्रिय प्रक्रियाओं के माध्यम से निवेश कर सकता है। इसमें स्टॉक मार्केट के साथ-साथ डेब्ट इंस्ट्रूमेंट्स भी शामिल हो सकते हैं। इससे निवेशकों को उत्तम रिटर्न की संभावना होती है, साथ ही उनकी निवेश की सुरक्षा भी सुनिश्चित होती है।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 10,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Tax Saving Mutual Fund क्या है?",
                description = "टैक्स सेविंग म्यूचुअल फंड (Tax Saving Mutual Fund) एक विशेष प्रकार का म्यूचुअल फंड होता है जिसमें निवेशक अपने निवेश के लिए आयकर छूट प्राप्त कर सकते हैं। ये फंड 80C के अंतर्गत आते हैं और आमतौर पर निवेशकों को विभिन्न आयकर नियमों के तहत आयकर बचाने की सुविधा प्रदान करते हैं।\n\nइन फंडों में निवेश करने पर निवेशकों को निवेश के लिए किए गए निवेश की राशि पर आयकर छूट मिल सकती है, जो उनकी कुल आय को कम करने में मदद करती है।\n\nइन फंडों का निवेश लॉक इन होता है और निवेशकों को निवेश की राशि को निकालने में निर्बधता की सीमा लगाई जाती है। यदि निवेशक निवेश को एक निश्चित अवधि तक नहीं बनाए रखता है, तो उन्हें निवेश की राशि को निकालने पर कर कटौती का सामना करना पड़ सकता है।\n\nइस प्रकार के फंड आमतौर पर शेयरों में निवेश करते हैं और निवेश के लिए प्राथमिकता रखते हैं, लेकिन ये निवेश अनिवार्य रूप से किसी निश्चित सेक्टर में नहीं होता।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 11,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Index Mutual Fund क्या है?",
                description = "इंडेक्स म्यूचुअल फंड (Index Mutual Fund) एक तरह का म्यूचुअल फंड होता है जो किसी विशेष सूचकांक (इंडेक्स) के अनुसार निवेश करता है। इसका मकसद होता है निवेशकों को वही रिटर्न प्राप्त करना जो उस इंडेक्स के अनुसार होता है।\n\nयह फंड उन लोगों के लिए अच्छा होता है जो शेयर बाजार में निवेश करना चाहते हैं, लेकिन उनके पास समय या ज्ञान नहीं है कि किस शेयर में निवेश करें। इसमें निवेशकों को ब्रोकर के लागत या वित्तीय विशेषज्ञता की आवश्यकता नहीं होती क्योंकि ये फंड अपने निवेशों को अपने निर्धारित इंडेक्स के अनुसार निवेश करते हैं।\n\nउदाहरण के लिए, यदि कोई व्यक्ति एक इंडेक्स म्यूचुअल फंड में निवेश करता है जो सेंसेक्स या निफ्टी के अनुसार निवेश करता है, तो वह फंड सेंसेक्स या निफ्टी के प्रमुख शेयरों में निवेश करेगा। इस तरह के निवेश का उद्देश्य होता है कि फंड का रिटर्न संबंधित इंडेक्स के रिटर्न के समान हो।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),

            ModelSubTopic(
                id = 12,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "ETF क्या है?",
                description = "ETF का मतलब होता है \"एक्सचेंज-ट्रेडेड फंड\"। ये एक प्रकार का निवेश फंड होता है जो शेयर बाजार पर व्यापक तौर पर बेचा-जाता है, जैसे शेयर करता है। ईटीएफ में प्रमुख रूप से शेयर, खनिज पदार्थ, या बांड आदि के एसेस्ट्स होते हैं। सामान्य रूप से, ईटीएफ अपने नेट एसेट वैल्यू के करीब बेचे जाते हैं। निवेशक ईटीएफ के शेयरों को शेयर बाजार में खरीदा जा सकता है और बाजार के दौरान उसका दाम नेट एसेट वैल्यू से भिन्न हो सकता है।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            ),


            ModelSubTopic(
                id = 13,
                topic = Constants.KEY_TOPIC_MUTUAL_FUNDS,
                title = "Hedge Fund क्या है?",
                description = "हेज फंड (Hedge Fund) एक प्रकार का निवेश फंड होता है जो निवेश के लिए अलग-अलग तरीकों से निवेश करता है और अधिक प्रतिस्पर्धी तथा व्यावसायिक रूप से निर्णय लेने का प्रयास करता है। हेज फंड्स को उच्च नेट-वर्थ वाले व्यक्तियों, संस्थागत निवेशकों, और पेंशन फंड्स द्वारा इस्तेमाल किया जाता है। ये फंड प्रमुख रूप से मध्यस्थता, लीवरेज्ड ट्रेड, और डेरिवेटिव का उपयोग करते हैं ताकि अधिक लाभ कमाया जा सके। हेज फंड्स की खास बात ये होती है कि ये निवेश के लिए निवेश के लिए काम करती है और ये किसी विशेष उद्योग या क्षेत्र में निवेश नहीं करती, जैसे कि इक्विटी, डेट या रियल एस्टेट।",
                imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp"
            )
        )

    }

}