package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Nifty {

    fun getNiftyList(): List<ModelSubTopic> {
        return listOf(


            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_NIFTY,
                title = "Nifty क्या है?",
                description = "Nifty का पूरा नाम है \"National Stock Exchange 50\" और यह भारतीय शेयर बाजार का मुख्य Index है। यह National Stock Exchange (NSE) द्वारा प्रबंधित किया जाता है और इसमें 50 अच्छी कंपनियों के शेयर शामिल होते हैं। निफ्टी का मुख्य उद्देश्य भारतीय शेयर बाजार के सामान्य माहौल को प्रतिबिंबित करना है। अगर निफ्टी का मूल्य बढ़ रहा है, तो बाजार को सकारात्मक माना जाता है, जबकि निफ्टी के मूल्य में कमी बाजार को अधिक डरावना बना सकता है। यह निवेशकों को बाजार के सामान्य माहौल की समीक्षा करने में मदद करता है और उन्हें निवेश के निर्णय लेने में मार्गदर्शन प्रदान करता है।\n\nमान लें कि आपने निफ्टी की कीमत को देखा और वह बढ़ रही है। इसका अर्थ है कि बाजार में सामान्य रूप से आत्मविश्वास है, क्योंकि निफ्टी 50 शेयरों का यह समूह आर्थिक संदेश को प्रतिबिंबित करता है।\n\nअब, अगर आपके पास एक शेयर खरीदने का विचार है, तो आप निफ्टी 50 में शामिल किसी कंपनी के शेयर को चुन सकते हैं, उदाहरण के लिए \"Tata Consultancy Services (TCS)\"। यदि निफ्टी की कीमत बढ़ रही है तो इससे संभावना है कि आपके इन्वेस्टमेंट की मान्यता और लाभ की संभावना बढ़ सकती है।\n\nइस प्रकार, निफ्टी ने आपको बाजार में समीक्षा करने में मदद की और आपको निवेश के निर्णय लेने में एक मार्गदर्शक की भूमिका निभाई।\n\nक्या यह समझने में मददगार था?",
                imgUrl = "https://media.istockphoto.com/id/2072952800/vector/bse-building-bombay-stock-exchange-market-growth-stock-market-trading-indian-businesses.jpg?s=612x612&w=0&k=20&c=wEH8EqWSMKTlrmFY9yrHQNc7e6H-4On0QCluxhb9ECI="
            ),



            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_NIFTY,
                title = "Nifty का क्या Role है?",
                description = "निफ्टी का मुख्य रोल है बाजार की स्थिति को दर्शाना। यह एक Index है जो भारतीय शेयर बाजार के 50 बड़े कंपनियों के स्टॉक को रेट करता है।\n\nउदाहरण के रूप में, सोचिए कि आपने दो कंपनियों के शेयर में निवेश करने का विचार किया है: एक है \"Tata Consultancy Services (TCS)\" और दूसरी \"Reliance Industries Limited (RIL)\"।\n\nअब, आप चाहते हैं कि आपका निवेश उन कंपनियों में सुरक्षित हो और आप उन्हें अच्छी प्रदर्शन करने वाली कंपनियों में निवेश करें।\n\nआपने निफ्टी की कीमत देखी और देखा कि निफ्टी की कीमत बढ़ रही है। यह इससे पता चलता है कि बाजार में सामान्यतः आत्मविश्वास है और निवेशकों का विश्वास बढ़ा है।\n\nअब, जब आप TCS और RIL जैसी कंपनियों में निवेश करते हैं, तो आप निफ्टी की कीमत को भी ध्यान में रखते हैं। अगर निफ्टी की कीमत बढ़ रही है, तो आपका निवेश भी समर्थन मिल सकता है, क्योंकि बाजार में विश्वास है और शेयरों की मांग भी बढ़ सकती है।\n\nइस प्रकार, निफ्टी ने आपको उचित निवेश की दिशा में मार्गदर्शन प्रदान किया।",
                imgUrl = "https://media.istockphoto.com/id/2072952800/vector/bse-building-bombay-stock-exchange-market-growth-stock-market-trading-indian-businesses.jpg?s=612x612&w=0&k=20&c=wEH8EqWSMKTlrmFY9yrHQNc7e6H-4On0QCluxhb9ECI="
            ),

            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_NIFTY,
                title = "Nifty किस प्रकार बनता है?",
                description = "निफ्टी का निर्माण विशेष तरीके से होता है, जिसमें कुछ मुख्य चरण होते हैं। यहाँ एक उदाहरण दिया गया है:\n\n1. कंपनी का चयन: सबसे पहला कदम है 50 बड़ी और महत्वपूर्ण कंपनियों का चयन करना जो भारतीय शेयर बाजार में महत्वपूर्ण हैं। इसके लिए, एक कमेटी या निदेशक मंडली बनाई जाती है जो अनुसंधान और विश्लेषण के आधार पर इन कंपनियों का चयन करती है।\n\n2. कंपनियों के अनुपात का तय करना: चयनित कंपनियों के शेयरों का एक उचित और संतुलित अनुपात तय किया जाता है। यह सुनिश्चित करता है कि निफ्टी शेयर अलग-अलग क्षेत्रों से होने वाली जोखिमों का समावेश करता है।\n\n3. निफ्टी की गणना: चयनित कंपनियों के स्टॉक के मूल्यों का योग करके और उनका उचित अनुपात लागू करके निफ्टी का मूल्य गणना किया जाता है। यह गणना प्रतिदिन की जाती है।\n\nउदाहरण के रूप में, यदि \"Tata Motors\", \"HDFC Bank\", \"Reliance Industries\" और \"Infosys\" जैसी कंपनियाँ चयनित होती हैं, तो उनके स्टॉक के मूल्यों का योग करके और उचित अनुपात लागू करके निफ्टी का मूल्य गणना किया जाता है। इससे निफ्टी का मूल्य तय होता है जो बाजार के मुख्य Index के रूप में काम करता है।",
                imgUrl = "https://media.istockphoto.com/id/2072952800/vector/bse-building-bombay-stock-exchange-market-growth-stock-market-trading-indian-businesses.jpg?s=612x612&w=0&k=20&c=wEH8EqWSMKTlrmFY9yrHQNc7e6H-4On0QCluxhb9ECI="
            ),


            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_NIFTY,
                title = "Nifty और अर्थव्यवस्था",
                description = "निफ्टी और अर्थव्यवस्था के बीच गहरा संबंध होता है। निफ्टी एक Index है जो भारतीय शेयर बाजार की स्थिति को मापता है, जबकि अर्थव्यवस्था देश की सामाजिक और आर्थिक स्थिति का प्रतिनिधित्व करती है।\n\nनिफ्टी की कीमत में बदलाव दिखाई देता है कि बाजार की कैसी स्थिति है, जिसमें विभिन्न अर्थव्यवस्थात्मक प्रभाव शामिल होते हैं। उच्च निफ्टी की कीमत और स्थिर अर्थव्यवस्था उम्मीद की ओर संकेत कर सकते हैं, जबकि निम्न निफ्टी की कीमत और अस्थिरता आर्थिक अवस्था की संकेत देती है।\n\nअतः, निफ्टी एक मार्कर होता है जो विभिन्न आर्थिक प्रक्रियाओं और परिस्थितियों को मापता है और अर्थव्यवस्था के प्रति बाजार के विश्वास को प्रकट करता है।",
                imgUrl = "https://media.istockphoto.com/id/2072952800/vector/bse-building-bombay-stock-exchange-market-growth-stock-market-trading-indian-businesses.jpg?s=612x612&w=0&k=20&c=wEH8EqWSMKTlrmFY9yrHQNc7e6H-4On0QCluxhb9ECI="
            ),


            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_NIFTY,
                title = "Nifty के फायदे",
                description = "निफ्टी के कई फायदे होते हैं, जो निम्नलिखित हैं:\n\n1. बाजार की स्थिति का मापदंड: निफ्टी बाजार की स्थिति को मापने का महत्वपूर्ण मापदंड होता है। इसके माध्यम से निवेशक बाजार की स्थिति को समझ सकते हैं और अपने निवेश के निर्णय लेते हैं।\n\n2. विविधता का प्रतिनिधित्व: निफ्टी 50 में विभिन्न क्षेत्रों की कंपनियों के शेयरों का समावेश होता है, जिससे निवेशक अपने पोर्टफोलियो को विविध कर सकते हैं।\n\n3. सरलता: निफ्टी की गतिविधि को समझना आसान होता है और इसे अन्य इंडेक्सों के साथ तुलना करना सरल होता है।\n\n4. उपलब्धता: निफ्टी शेयरों का खरीद और बेचना आसान होता है, जिससे निवेशकों को बाजार में शामिल होने का अधिक अवसर मिलता है।\n\n5. लाभकारी: निफ्टी में निवेश करने से निवेशकों को बाजार के उच्च और निम्न स्तरों पर लाभ प्राप्त करने का मौका मिलता है।\n\nइन फायदों के साथ-साथ, निफ्टी निवेशकों को बाजार में अधिक विश्वास और स्थिरता प्रदान करता है।",
                imgUrl = "https://media.istockphoto.com/id/2072952800/vector/bse-building-bombay-stock-exchange-market-growth-stock-market-trading-indian-businesses.jpg?s=612x612&w=0&k=20&c=wEH8EqWSMKTlrmFY9yrHQNc7e6H-4On0QCluxhb9ECI="
            ),


            ModelSubTopic(
                id = 6,
                topic = Constants.KEY_TOPIC_NIFTY,
                title = "Nifty और Sensex में अंतर",
                description = "Nifty और Sensex दोनों ही भारतीय शेयर बाजार के मुख्य इंडेक्स हैं, लेकिन उनमें कुछ मुख्य अंतर होते हैं। यहां वे अंतर दिए जा रहे हैं:\n\n1. प्रतिनिधित्व: Nifty 50 नेशनल स्टॉक एक्सचेंज (NSE) द्वारा प्रबंधित किया जाता है, जबकि Sensex बॉम्बे स्टॉक एक्सचेंज (BSE) द्वारा प्रबंधित किया जाता है।\n\n2. कंपनियों की संख्या: Nifty 50 में लगभग 50 बड़ी कंपनियों के शेयर शामिल होते हैं, जबकि Sensex में लगभग 30 बड़ी कंपनियों के शेयर होते हैं।\n\n3. प्रभावित क्षेत्र: Nifty 50 और Sensex दोनों ही भारतीय शेयर बाजार की प्रमुख इंडेक्स हैं, लेकिन उनमें कंपनियों का चयन और प्रभावित क्षेत्र में थोड़ा अंतर होता है।\n\n4. प्रारंभिक मूल्य: Nifty 50 का प्रारंभिक मूल्य गणना को अक्सर 1000 को बेस मानते हैं, जबकि Sensex का प्रारंभिक मूल्य गणना को 100 को बेस मानते हैं।\n\n5. समय: Nifty 50 की स्थिति को NSE द्वारा प्रत्येक सेकंड में अपडेट किया जाता है, जबकि Sensex की स्थिति को BSE द्वारा प्रति मिनट में अपडेट किया जाता है।\n\nये थे कुछ मुख्य अंतर Nifty 50 और Sensex में। यह इंडेक्स बाजार की स्थिति का मापदंड होते हैं और निवेशकों को बाजार की दिशा में मदद करते हैं।",
                imgUrl = "https://media.istockphoto.com/id/2072952800/vector/bse-building-bombay-stock-exchange-market-growth-stock-market-trading-indian-businesses.jpg?s=612x612&w=0&k=20&c=wEH8EqWSMKTlrmFY9yrHQNc7e6H-4On0QCluxhb9ECI="
            ),


            ModelSubTopic(
                id = 7,
                topic = Constants.KEY_TOPIC_NIFTY,
                title = "Nifty ETF क्या है?",
                description = "Nifty ETF वास्तविक शेयरों के खरीदने के बजाय निफ्टी के शेयरों का निवेश करने का तरीका है। यदि आपको निफ्टी 50 इंडेक्स में शामिल कंपनियों में निवेश करना है, तो आप एक निफ्टी ETF में निवेश कर सकते हैं।\n\nउदाहरण के लिए, यदि निफ्टी 50 में \"Tata Motors\", \"HDFC Bank\", \"Reliance Industries\" और \"Infosys\" शामिल हैं, तो एक निफ्टी ETF में निवेश करने का मतलब है कि आप इन कंपनियों में साझेदारी के रूप में निवेश कर रहे हैं, जिससे आप निफ्टी के प्रति बदलाव का लाभ उठा सकते हैं बिना हर एक शेयर को खरीदने के लिए पैसा खर्च करने की आवश्यकता हो।",
                imgUrl = "https://media.istockphoto.com/id/2072952800/vector/bse-building-bombay-stock-exchange-market-growth-stock-market-trading-indian-businesses.jpg?s=612x612&w=0&k=20&c=wEH8EqWSMKTlrmFY9yrHQNc7e6H-4On0QCluxhb9ECI="
            )

        )
    }

}