package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Sensex {

    fun getSensexList():List<ModelSubTopic>{
        return listOf(

            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_SENSEX,
                title = "Sensex क्या है?",
                description = "Sensex एक मापदंड है जो भारतीय पूंजी बाजार की स्थिति को प्रतिबिंबित करता है। यह एक प्रमुख इंडेक्स है जो बॉम्बे स्टॉक एक्सचेंज (BSE) पर आधारित है। Sensex में उन 30 शेयरों का समावेश होता है जो BSE पर सबसे विश्वसनीय और व्यापक कंपनियों की सूची में शामिल हैं।\n\nSensex की कीमत में बदलाव भारतीय शेयर बाजार की स्थिति को मापने का माध्यम होता है। इसके माध्यम से, निवेशक बाजार की स्थिति को समझ सकते हैं और निवेश के निर्णय ले सकते हैं।\n\nइस तरह, Sensex भारतीय शेयर बाजार के प्रमुख इंडेक्स में से एक है जो निवेशकों को बाजार की स्थिति की जानकारी प्रदान करता है।",
                imgUrl = "https://www.tickertape.in/blog/wp-content/uploads/2022/05/TT-25-May-Sensex-BB-1200x900-cropped.jpeg"
            ),

            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_SENSEX,
                title = "Sensex कैसे बनता है?",
                description = "Sensex को तैयार करने के लिए निम्नलिखित चरणों का पालन किया जाता है:\n\n1. कंपनी का चयन: पहले चरण में, बॉम्बे स्टॉक एक्सचेंज (BSE) की टीम एक सूची तैयार करती है जिसमें वे 30 श्रेणीबद्ध और विश्वसनीय कंपनियों को शामिल करते हैं।\n\n2. शेयरों का वितरण: एक बार कंपनियों का चयन किया जाता है, उनके शेयरों का वितरण तैयार किया जाता है। इसमें शेयरों के मूल्यों का योग लिया जाता है।\n\n3. वजनीत करना: हर एक कंपनी के शेयर को उसके मानक मूल्य के आधार पर वजनीत किया जाता है। यह वजन उनके बाजार मूल्य के आधार पर होता है।\n\n4. Sensex की गणना: अब, इन वजनों का योग लिया जाता है ताकि एक समय स्थिति में Sensex की गणना की जा सके। यह गणना प्रति मिनट में बोर्ड पर प्रदर्शित होती है।\n\n5. Sensex का प्रकाशन: गणना के बाद, Sensex का मूल्य प्रकाशित किया जाता है। यह स्थिति बाजार की स्थिति को प्रतिबिंबित करती है और निवेशकों को बाजार में ताजगी के बारे में सूचित करती है।\n\nइस तरह, Sensex को तैयार करने के लिए यह प्रक्रिया अनुसरण की जाती है जो बाजार की स्थिति को प्रतिबिंबित करती है।",
                imgUrl = "https://www.tickertape.in/blog/wp-content/uploads/2022/05/TT-25-May-Sensex-BB-1200x900-cropped.jpeg"
            ),


            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_SENSEX,
                title = "Sensex की गणना कैसे की जाती है?",
                description = "Sensex की गणना एक संशोधित प्रति कृति का अंश है, जिसमें 30 विभिन्न कंपनियों के शेयरों के मूल्य का योग किया जाता है। इस प्रक्रिया में निम्नलिखित चरण होते हैं:\n\n1. शेयरों के मूल्यों का योग: सबसे पहले, Sensex के सभी 30 कंपनियों के शेयरों का मूल्यों का योग किया जाता है। यह मूल्यों का योग हर एक कंपनी के वजनीत मूल्य से किया जाता है, जो कंपनी के बाजार मूल्य के आधार पर होता है।\n\n2. संशोधित योग: योग के बाद, एक संशोधित प्रति कृति को प्राप्त करने के लिए एक आधार तैयार किया जाता है। यह संशोधित प्रति कृति Sensex का मूल्य होता है।\n\n3. मूल्य इंडेक्स दर: अंत में, संशोधित प्रति कृति को एक विशेष इंडेक्स दर के साथ विभाजित किया जाता है, जो पहले की तुलना में कमी या वृद्धि को दर्शाता है। इससे Sensex का मूल्य तय होता है।\n\nइस प्रक्रिया के माध्यम से, Sensex का मूल्य निर्धारित किया जाता है जो बाजार की स्थिति को प्रतिबिंबित करता है।",
                imgUrl = "https://www.tickertape.in/blog/wp-content/uploads/2022/05/TT-25-May-Sensex-BB-1200x900-cropped.jpeg"
            ),

            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_SENSEX,
                title = "Sensex घटता-बढ़ता क्यों है?",
                description = "Sensex का मूल्य घटता और बढ़ता उसके भीतर शामिल कंपनियों के शेयरों की मूल्य में परिवर्तन के कारण होता है। इन परिवर्तनों के कई कारण हो सकते हैं, जैसे:\n\n1. अर्थव्यवस्था की स्थिति: जब अर्थव्यवस्था मजबूत होती है और विश्वास का माहौल होता है, तो कंपनियों की कमाई में वृद्धि होती है और उनके शेयरों की कीमतें बढ़ती हैं। इसके परिणामस्वरूप, Sensex में भी वृद्धि होती है।\n\n2. राजनीतिक और अर्थव्यवस्था के निर्णय: सरकार के निर्णय, आर्थिक नीतियाँ और निर्देशन, विदेशी और घरेलू निवेश, आदि Sensex को प्रभावित कर सकते हैं। उदाहरण के लिए, किसी निवेशक ने किसी कंपनी के शेयरों में निवेश किया हो, तो उसकी कमाई में वृद्धि होने पर Sensex में वृद्धि हो सकती है।\n\n3. अंतरराष्ट्रीय घटनाएँ: अंतरराष्ट्रीय घटनाएँ, जैसे कि विदेशी बाजारों की स्थिति, महत्वपूर्ण राजनीतिक और आर्थिक घटनाएँ, विदेशी मुद्रा और कमोडिटी के मूल्यों में परिवर्तन, भी Sensex पर प्रभाव डाल सकते हैं।\n\n4. बाजार के अन्य कारक: बाजार में निवेशकों की संख्या, वित्तीय उत्पादों की प्राचीनता, वित्तीय निर्णयों का प्रभाव, और अन्य वित्तीय कारक भी Sensex में परिवर्तन को प्रभावित कर सकते हैं।\n\nइन सभी कारणों से, Sensex की कीमतें घट सकती हैं या बढ़ सकती हैं।",
                imgUrl = "https://www.tickertape.in/blog/wp-content/uploads/2022/05/TT-25-May-Sensex-BB-1200x900-cropped.jpeg"
            )


            )
    }
}