package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object SIP {

    fun getSIPList():List<ModelSubTopic>{
        return listOf(

            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_SIP,
                title = "SIP क्या है?",
                description = "SIP (Systematic Investment Plan) एक निवेश प्रणाली है जिसमें निवेशक नियमित अंतराल पर निश्चित धनराशि में निवेश करते हैं। यह एक लंबे समय तक निवेश की दृष्टि से एक सुचारू और नियमित तरीका है। इसका मुख्य उद्देश्य निवेशकों को लंबे समय तक धीरे-धीरे निवेश करने की अनुमति देना है, जिससे उन्हें समृद्धि की प्राप्ति में मदद मिल सके।\n\nयह आमतौर पर बैंकों और निवेश कंपनियों द्वारा प्रदान की जाती है, जिसमें निवेशक किसी निर्दिष्ट मात्रा में पैसे को निवेश के लिए संयुक्त धनराशि में जमा करते हैं। निवेशक एक नियमित अंतराल पर निवेश करते रहते हैं, जैसे महीने के आखिरी या पहले दिन। इस प्रकार, वे विस्तृत समय अवधि में समृद्धि की उम्मीद कर सकते हैं।\n\nयह एक सुरक्षित और उचित तरीका है निवेश करने का, क्योंकि निवेशक को धीमे-धीमे और नियमित रूप से निवेश करने का अवसर मिलता है, जिससे वे बाजार के उतार-चढ़ाव का सामना कर सकते हैं। इसके साथ ही, समय गुजरने पर अधिक निवेश की रकम भी बढ़ सकती है, जिससे निवेशकों को बेहतर लाभ की प्राप्ति हो सकती है।\n\nचलिए एक उदाहरण देखते हैं:\n\nध्यान दें कि एक व्यक्ति ने महीने के प्रारंभ में SIP के माध्यम से 5000 रुपये निवेश करने का निर्णय किया है। वह हर महीने 5000 रुपये को निवेश के लिए चुने गए म्यूच्यूअल फंड में निवेश करता है। अब सोचिए, वह यह निवेश 5 साल के लिए कर रहा है।\n\nचलिए अब यहाँ देखें कि इसके परिणाम क्या हो सकते हैं:\n\n• प्रत्येक महीने, निवेशक 5000 रुपये को निवेश करता है।\n• प्रत्येक महीने के निवेश की कीमत और इक्विटी की कीमत में उतार-चढ़ाव के आधार पर निर्भर करेगी।\n• 5 साल के बाद, निवेशक को उस वक्त का उचित रिटर्न प्राप्त हो सकता है, जिसमें निवेश के लिए किए गए सभी निवेशों का उचित औसत रिटर्न शामिल होता है।\n\nइस उदाहरण में, SIP के माध्यम से निवेश करने से निवेशक को लंबे समय तक निवेश का लाभ मिल सकता है और उसकी निवेश राशि भी बढ़ सकती है।",
                imgUrl = "https://www.smallcase.com/wp-content/uploads/2023/02/Hero-new-SIP-2.png"
            ),

            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_SIP,
                title = "SIP कैसे काम करता है?",
                description = "SIP, या Systematic Investment Plan, एक ऐसी निवेश प्रक्रिया है जिसमें निवेशक नियमित अंतराल में निवेश करता है, जैसे महीना, तिमाही या वार्षिक। इसमें निवेशक नियमित अंतराल में निर्धारित राशि को एक निश्चित अंतराल के दौरान निवेश करता है, जिससे उसके निवेश को दिनांक की मार्केट वॉलेटिलिटी से बचाया जा सकता है।\n\nयहाँ एक उदाहरण है:\n\nएक व्यक्ति ने नियमित अंतराल में निवेश करने के लिए SIP शुरू किया है। वह हर महीने ₹5000 की राशि को एक चयनित म्यूच्यूअल फंड में निवेश करने का निर्णय किया है।\n\n• प्रत्येक महीने के अंत में, ₹5000 उस म्यूच्यूअल फंड में निवेश होते हैं।\n• निवेश की कीमत विभिन्न महीनों में बदल सकती है, लेकिन निवेशक नियमित अंतराल में निवेश करता रहता है।\n• इस प्रक्रिया को निरंतर जारी रखने से निवेशक वित्तीय वर्षों में अच्छे रिटर्न प्राप्त कर सकता है और लंबे समय तक धीरे-धीरे धन जमा कर सकता है।",
                imgUrl = "https://www.smallcase.com/wp-content/uploads/2023/02/Hero-new-SIP-2.png"
            ),


            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_SIP,
                title = "SIP के प्लांस के प्रकार",
                description = "SIP के प्लांस के कुछ प्रमुख प्रकार हैं:\n\n1. Regular SIP (रेगुलर एसआईपी): इसमें निवेशक नियमित अंतराल में निर्धारित राशि को निवेश करता है, जैसे महीना, तिमाही या वार्षिक। यह निवेशक को निवेश करने की नियमितता और वित्तीय व्यवस्था की सुविधा प्रदान करता है।\n\n2. Top-up SIP (टॉप-अप एसआईपी): यह प्लान निवेशक को उनके निवेश को बढ़ाने के लिए विकल्प प्रदान करता है। निवेशक अपने SIP राशि को समय-समय पर बढ़ा सकता है, जिससे उनकी निवेश राशि में वृद्धि होती है।\n\n3. Flexi SIP (फ्लेक्सी एसआईपी): इसमें निवेशक को निवेश करने की राशि में लाभ के अनुसार वैश्विक संख्या निर्धारित करने की सुविधा प्रदान की जाती है। इस प्लान में निवेशक निवेश की राशि को वृद्धि या घटाव के अनुसार समायोजित कर सकता है।\n\n4. Trigger SIP (ट्रिगर एसआईपी): इसमें निवेशक को निवेश करने के लिए निवेश की विशेष दिशा या मानक के आधार पर निवेश की राशि को स्वचालित रूप से शुरू करने की सुविधा प्रदान की जाती है। उदाहरण के लिए, जब निवेशक को निवेश की कीमत एक निश्चित स्तर पर पहुंच जाती है, तो SIP की प्रक्रिया स्वचालित रूप से शुरू हो जाती है।",
                imgUrl = "https://www.smallcase.com/wp-content/uploads/2023/02/Hero-new-SIP-2.png"
            ),


            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_SIP,
                title = "SIP में निवेश के लाभ",
                description = "SIP में निवेश के कुछ मुख्य लाभ हैं:\n\n1. वित्तीय व्यवस्था की सुविधा: SIP निवेशकों को नियमित अंतराल में निवेश करने की सुविधा प्रदान करता है, जिससे वे अपने निवेश को सावधानीपूर्वक प्रबंधित कर सकते हैं।\n\n2. औसत की लाभ: SIP में निवेशक को निवेश करने की राशि को बटोरने के लिए बड़ी राशि की जरूरत नहीं होती है, जिससे वे निवेश की औसत की लाभ उठा सकते हैं।\n\n3. निवेश में स्थिरता: SIP निवेशकों को निवेश करने की सामग्री को स्थिर रखने में मदद करता है, जिससे उन्हें निवेश की स्थिरता और धीरे-धीरे वृद्धि का लाभ होता है।\n\n4. समय में और पैसे के दर्शन का मिश्रण: SIP निवेशकों को समय में और पैसे के दर्शन का मिश्रण प्रदान करता है, जिससे वे समय के साथ अपने निवेश का लाभ उठा सकते हैं।\n\n5. वित्तीय लक्ष्य की संवेदनशीलता: SIP निवेशकों को वित्तीय लक्ष्य को साधने के लिए लक्ष्य सेट करने और अपने निवेश को उसी के अनुसार प्रबंधित करने की संवेदनशीलता प्रदान करता है।",
                imgUrl = "https://www.smallcase.com/wp-content/uploads/2023/02/Hero-new-SIP-2.png"
            ),


            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_SIP,
                title = "SIP कंपाउंडिंग की पावर",
                description = "SIP (Systematic Investment Plan) में कंपाउंडिंग की पावर उसका एक मुख्य लाभ है। यह एक नियमित निवेश प्रक्रिया है जिसमें निवेशक नियमित अंतराल में निवेश करते हैं, और जब निवेश निवेश की मुख्य राशि पर होता है, तो पिछले निवेश के लाभ पर भी निवेश किया जाता है।\n\nइस प्रक्रिया में, निवेशकों को बार-बार निवेश करने की आवश्यकता नहीं होती है, बल्कि वे नियमित अंतराल में निवेश करते हैं, जो समय के साथ निवेश का लाभ बढ़ाता है। यह निवेश का एक प्रभावी और सामान्य तरीका है, जिससे निवेशक अपनी निवेश राशि को लंबे समय तक बढ़ाने का लाभ उठा सकते हैं।\n\nयह वित्तीय प्रक्रिया बचत और निवेश के लिए महत्वपूर्ण है क्योंकि इससे निवेशक अपनी निवेश की दर को बढ़ा सकते हैं, जो फिर से निवेश पर और अधिक लाभदायक होता है। यह एक स्थिर और सुरक्षित निवेश पद्धति है जो लंबे समय तक आपके लिए आय का स्रोत बन सकती है।\n\nएक उदाहरण समझते हैं।\n\nसुपोज कीजिए आपने हर महीने 5000 रुपये का SIP अपने म्यूचुअल फंड में निवेश किया। अगर आपका निवेशी म्यूचुअल फंड का रिटर्न औसतन 10% है, तो इसका मतलब है कि प्रत्येक साल में आपका निवेश 10% तक बढ़ेगा।\n\nपहले महीने में, आप 5000 रुपये निवेश करते हैं। अगले महीने में, यदि फंड की नई यूनिट की कीमत 100 रुपये है, तो आपको इसी राशि से अधिक या कम यूनिट मिलेगी, यानी 50 यूनिट।\n\nइस प्रकार, प्रत्येक महीने के साथ, आपके पास अधिक या कम यूनिट होती है जो आपकी निवेश राशि और निवेश के समय के साथ बढ़ती है।\n\nजैसे-जैसे समय बढ़ता है, आपके पास अधिक यूनिट होती हैं और इसका मतलब होता है कि आपका निवेश बढ़ता है और आपका निवेश का रिटर्न भी बढ़ता है।\n\nयही कंपाउंडिंग की पावर है। इसे आप लंबे समय तक निवेश करके अच्छे और स्थिर रिटर्न प्राप्त कर सकते हैं।",
                imgUrl = "https://www.smallcase.com/wp-content/uploads/2023/02/Hero-new-SIP-2.png"
            )

            )
    }
}