package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object StockMarket {

     fun getStockMarketTopic():List<ModelSubTopic>{
         return listOf(


             ModelSubTopic(
                 id = 1,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "शेयर बाजार क्या होता है?",
                 description = "शेयर बाजार में शेयर का मतलब होता है हिस्सा। यहाँ लोग शेयर्स खरीदने और बेचने के लिए जाते हैं। बाजार वह जगह होती है जहाँ आप खरीद-बिक्री कर सकते हैं। भारत में, बोम्बे स्टॉक एक्सचेंज (BSE) और नेशनल स्टॉक एक्सचेंज (NSE) जैसे प्रमुख शेयर बाजार हैं।\n\nबोम्बे स्टॉक एक्सचेंज (BSE) या NSE में ही किसी लिस्टेड कंपनी के शेयर ब्रोकर के माध्यम से खरीदे और बेचे जाते हैं। शेयर बाजार में हालांकि बांड, म्युचुअल फंड और डेरिवेटिव का भी व्यापार होता है।\n\nबड़े रिटर्न की उम्मीद के साथ ही घरेलू और विदेशी निवेशक (FII या FPI) भी शेयर बाजार में निवेश करते हैं।\n\nशेयर खरीदने का मतलब क्या है?\n\nमान लीजिए कि NSE में सूचीबद्ध किसी कंपनी ने कुल 20 लाख शेयर जारी किए हैं। आप उस कंपनी के प्रस्ताव के अनुसार जितने शेयर खरीद लेते हैं आपका उस कंपनी में उतने हिस्से का मालिकाना हक हो गया। आप अपने हिस्से के शेयर किसी अन्य खरीदार को जब भी चाहें बेच सकते हैं।\n\nकंपनी जब शेयर जारी करती है, उस वक्त किसी व्यक्ति या समूह को कितने शेयर देना है, यह उसके विवेक पर निर्भर है। शेयर बाजार से शेयर खरीदने/बेचने के लिए आपको ब्रोकर की मदद लेनी होती है। ब्रोकर शेयर खरीदने-बेचने में अपने ग्राहकों से कमीशन चार्ज करते हैं।\n\nकिसी लिस्टेड कंपनी के शेयरों का मूल्य BSE/NSE में दर्ज होता है। सभी सूचीबद्ध कंपनियों के शेयरों का मूल्य उनकी लाभ कमाने की क्षमता के अनुसार घटता-बढ़ता रहता है।\n\nशेयर बाजार का नियंत्रण भारतीय प्रतिभूति एवं विनिमय बोर्ड (सेबी या SEBI) के हाथ में होता है। SEBI की अनुमति के बाद ही कोई कंपनी शेयर बाजार में लिस्ट होकर अपना प्रारंभिक निर्गम इश्यू (आईपीओ या IPO) जारी कर सकती है।\n\nप्रत्येक तिमाही/छमाही या सालाना आधार पर कंपनियाँ मुनाफा कमाने पर हिस्सेदारों को लाभांश देती हैं। कंपनी की गतिविधियों की जानकारी SEBI और BSE/NSE की वेबसाइट पर भी उपलब्ध होती है।\n\nकोई कंपनी BSE/NSE में कैसे लिस्ट होती है?\n\nशेयर बाजार में लिस्ट होने के लिए कंपनी को शेयर बाजार से लिखित समझौता करना पड़ता है। इसके बाद कंपनी पूंजी बाजार नियामक SEBI के पास अपने सभी जरूरी दस्तावेज जमा करती है। SEBI की जांच में सूचना सही होने और सभी शर्तें पूरा करते ही कंपनी BSE/NSE में लिस्ट हो जाती है।\n\nइसके बाद कंपनी अपनी हर गतिविधि की जानकारी शेयर बाजार (Stock Market) को समय-समय पर देती रहती है। इनमें खास तौर पर ऐसी जानकारियाँ शामिल होती हैं, जिससे निवेशकों के हित प्रभावित होते हों।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),

             ModelSubTopic(
                 id = 2,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "शेयर क्या है?",
                 description = "शेयर एक कंपनी की संपत्ति का हिस्सा होता है, जिसे वित्तीय बाजार में खरीदा और बेचा जा सकता है। जब आप एक कंपनी के शेयर खरीदते हैं, तो आप उस कंपनी के मालिकाना हिस्सेदार बनते हैं।\n\nइसका मतलब है कि आपके पास उस कंपनी के लिए मालिकाना हक होता है और आपके पास उस कंपनी की लाभांश और हानियों का हिस्सा होता है।\n\nशेयरों की मूल्य को बाजार के माध्यम से निर्धारित किया जाता है, और यह प्रतिदिन की तरह उतार-चढ़ाव में बदलते रहते हैं। शेयरों की खरीद और बिक्री का लाभ या हानि उनके मूल्य के बदलाव पर निर्भर होता है।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 3,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "शेयर बाजार में निवेश कैसे करें?",
                 description = "सबसे पहले आपको ब्रोकर की मदद से एक डीमैट अकाउंट खोलना होगा, जिसे आप हमारे ऐप के होम पेज पर जाकर किसी भी ब्रोकर के साथ ऑनलाइन खोल सकते हैं। इसके बाद आपको अपने डीमैट खाते को अपने बैंक खाते से लिंक करना होगा।\n\nअपने बैंक खाते से अपने डीमैट खाते में धनराशि स्थानांतरित करें, या तो ब्रोकर की वेबसाइट पर लॉग इन करके या किसी कंपनी के शेयर खरीदने के लिए सीधे उसके माध्यम से ऑर्डर देकर।\n\nएक बार खरीदने के बाद, शेयर आपके डीमैट खाते में स्थानांतरित कर दिए जाएंगे। आप जब चाहें बाजार समय के दौरान उन्हें ब्रोकर के माध्यम से बेच सकते हैं।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 4,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "डिविडेंड यील्ड क्या है?",
                 description = "डिविडेंड यील्ड एक वित्तीय माप है जो किसी कंपनी के शेयर के डिविडेंड का प्रतिशत लाभांश को दर्शाता है। यह उस कंपनी के प्रति शेयर डिविडेंड की राशि को उसके वर्तमान शेयर मूल्य से बाँटकर प्राप्त होने वाले प्रतिशत के रूप में उत्पन्न होता है।\n\nयह निर्धारण करने का एक तरीका है कि कोई निवेशक किसी कंपनी के शेयर खरीदकर उसके डिविडेंड के माध्यम से कितना लाभ कमा सकता है।\n\nडिविडेंड यील्ड का उदाहरण यह है कि एक कंपनी के शेयर की मूल्यांकन राशि 100 रुपये है और एक शेयर पर वार्षिक डिविडेंड 5 रुपये है, तो इस कंपनी का डिविडेंड यील्ड 5% होगा।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),

             ModelSubTopic(
                 id = 5,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "बुल मार्केट (Bull Market)",
                 description = "बुल मार्केट एक वित्तीय बाजार का टर्म है जो उत्तेजना और वृद्धि की स्थिति को दर्शाता है। बुल मार्केट में निवेशकों के बीच आमतौर पर आत्मविश्वास और उत्साह की भावना होती है।\n\nइसमें शेयरों, कमोडिटीज़, या अन्य निवेश संबंधी उत्पादों की मूल्यांकन में उतार-चढ़ाव के वृद्धि के दौरान सक्रियता और उत्तेजना होती है।\n\nबुल मार्केट में निवेशक आमतौर पर उत्तेजित और सकारात्मक होते हैं, और उन्हें आकर्षक लगता है कि उनके निवेशों में वृद्धि होगी।\n\nइस समय बाजार में शेयरों या अन्य निवेशों के मूल्य में उतार-चढ़ाव की स्थिति उत्तेजित होती है, जो कि निवेशकों को लाभ प्राप्त करने का अवसर प्रदान करती है। इसलिए, बुल मार्केट में निवेशक अक्सर खरीदारी करने को प्रेरित होते हैं।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 6,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "बेयर मार्केट (Bear Market)",
                 description = "बुल मार्केट के विपरीत, बेयर मार्केट एक वित्तीय बाजार की स्थिति को दर्शाता है जब शेयरों, कमोडिटीज़, या अन्य निवेश संबंधी उत्पादों की मूल्यांकन में निरंतर गिरावट दर्शाई जाती है।\n\nइस समय बाजार में निवेशकों की सामान्य रूप से निराशा और असुरक्षा का माहौल होता है, और उन्हें लगता है कि निवेशों के मूल्य में और गिरावट होने की संभावना है।\n\nबेयर मार्केट में निवेशक आमतौर पर निवेश करने के लिए अनुभवी और संवेदनशील होते हैं, क्योंकि वे मानते हैं कि बाजार में गिरावट और हानि की स्थिति है।\n\nइस प्रकार, बेयर मार्केट में निवेशकों के बीच आमतौर पर उदासीनता और नकारात्मकता की भावना होती है।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 7,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "Demat & Trading Account",
                 description = "डीमैट और ट्रेडिंग अकाउंट दो अलग-अलग फाइनैंशियल अकाउंट हैं, जो निवेशकों को वित्तीय बाजार में निवेश करने की सुविधा प्रदान करते हैं।\n\n1. डीमैट अकाउंट (Demat Account):\n\n• डीमैट अकाउंट एक वित्तीय खाता है जो निवेशकों को उनके निवेशों को इलेक्ट्रॉनिक रूप में संदर्भित करने की सुविधा प्रदान करता है।\n\n• यह अकाउंट निवेशकों को उनके निवेश की प्रमाणित कॉपी या स्टॉक सर्टिफिकेट की जगह देता है।\n\n• डीमैट अकाउंट के माध्यम से निवेशक शेयरों, बॉन्ड्स, म्युचुअल फंड्स और अन्य निवेश संबंधित उत्पादों को आसानी से खरीद और बेच सकते हैं।\n\n2. ट्रेडिंग अकाउंट (Trading Account):\n\n• ट्रेडिंग अकाउंट एक वित्तीय खाता होता है जो निवेशकों को बाजार में विभिन्न निवेश संबंधित उत्पादों की खरीद और बिक्री की सुविधा प्रदान करता है।\n\n• यह अकाउंट निवेशकों को ब्रोकर के माध्यम से बाजार में ट्रेड करने की अनुमति देता है।\n\n• निवेशक अपने ट्रेडिंग अकाउंट के माध्यम से बाजार में आधारित निवेश के निर्णय ले सकते हैं और ट्रेड कर सकते हैं।\n\nकुल मिलाकर, डीमैट अकाउंट निवेशों को संदर्भित करता है जबकि ट्रेडिंग अकाउंट निवेशों की खरीद और बिक्री को संदर्भित करता है।\n\nआमतौर पर, निवेशकों को डीमैट और ट्रेडिंग अकाउंट को संयुक्त रूप से उपयोग करने की सिफारिश की जाती है ताकि वे बाजार में निवेश कर सकें और अपने निवेशों को प्रबंधित कर सकें।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 8,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "IPO क्या होता है?",
                 description = "IPO का पूरा नाम Initial Public Offering है, जिसे हिंदी में \"प्रारंभिक सार्वजनिक प्रस्ताव\" कहा जाता है। यह एक प्रक्रिया होती है जिसमें एक प्राइवेट कंपनी अपने शेयरों का पहला लोकार्पण करती है और खासतौर पर पब्लिक को उनको खरीदने का अधिकार देती है।\n\nIPO के द्वारा कंपनी नए पूंजी जुटा सकती है और उसके अधिग्रहण या विकास की आवश्यकताओं को पूरा कर सकती है। इसके साथ ही, IPO कंपनी को सार्वजनिक स्तर पर पहचान देता है और उसके शेयरों की लिक्विडिटी को बढ़ाता है, जिससे शेयरों का मूल्य बढ़ सकता है।\n\nIPO के दौरान, एक कंपनी सार्वजनिक संस्थान, बैंक, या वित्तीय सलाहकार के माध्यम से अपने शेयरों की मूल्यांकन करती है और उन्हें शेयर बाजार में उपलब्ध कराती है।\n\nनिवेशक इन शेयरों को IPO के दौरान कंपनी से सीधे खरीद सकते हैं। यह एक उत्कृष्ट निवेश मौका हो सकता है लेकिन यह अधिक रिस्की भी हो सकता है, क्योंकि IPO कंपनी का प्रारंभिक लोकार्पण होता है और शेयरों की कीमत अधिकतम हो सकती है।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),

             ModelSubTopic(
                 id = 9,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "Blue Chip कंपनी क्या है?",
                 description = "ब्लू चिप कंपनी एक अच्छी तरह से स्थापित और वित्तीय रूप से स्थिर कंपनी है जिसकी आमतौर पर एक मजबूत प्रतिष्ठा होती है और शेयर बाजार में लगातार अच्छा प्रदर्शन करती है। इन कंपनियों को विश्वसनीय माना जाता है और इनका बाज़ार पूंजीकरण अक्सर बड़ा होता है।\n\nजैसे: Reliance, Hindustan Unilever, Tata, Infosys, HDFC Bank etc. ये सभी कंपनी स्टॉक एक्सचेंज पर चुनी गई ब्लू चिप कंपनी है।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 10,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "EPS क्या होता है?",
                 description = "EPS का मतलब होता है \"Earnings Per Share\"। यह एक वित्तीय प्राप्ति का मापक है जो कि सी कंपनी के प्रति शेयर के लिए आई है। यह उस कंपनी के निर्धारित वित्तीय वर्ष के दौरान कमाई का हिसाब लेता है और यह बताता है कि प्रति शेयर की आमदनी कितनी है। EPS की गणना करने के लिए, कंपनी के कुल निवेशकों को मिलाकर प्राप्ति का आंकलन किया जाता है और इसे कंपनी के कुल शेयरों के साथ विभाजित किया जाता है।\n\nयह बहुत ही महत्वपूर्ण है क्योंकि यह निवेशकों को बताता है कि हर एक शेयर के लिए कितनी कमाई हो रही है। EPS की अधिकता एक कंपनी की स्थिरता और लाभकारीता का प्रतीक हो सकती है। यह वित्तीय विश्लेषकों, निवेशकों और बाजार दर्शकों के लिए महत्वपूर्ण होता है जब वे किसी कंपनी के शेयरों में निवेश का निर्णय लेते हैं।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 11,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "पूंजीगत व्यय (CapEx) क्या होता है?",
                 description = "\"CAPEX\" का मतलब है \"Capital Expenditure\" है।\n\nCapEx, यानी पूंजीगत व्यय, एक कंपनी के द्वारा किए जाने वाले निवेश (निवेश) को दर्शाता है जो लंबी अवधि तक उपयुक्त होता है और संपन्नता का संकलन करता है। इस तरह के निवेश में नई संपत्ति की खरीद, Machinery और Equipment की खरीददारी, नई फैक्ट्री की इमारत या सुविधाओं का विकास, और दूसरी भौतिक और मूर्त संपत्ति के विकास का समावेश होता है।\n\nएक उदाहरण के रूप में, एक Automobile Manufacturing कंपनी जो अपनी उत्पादन क्षमता बढ़ाना चाहती है, नई Machinery और Equipment की खरीद करने के लिए CapEx करेगी। हाँ फिर, एक Real Estate Development कंपनी जो नई Residential Projects के लिए जमीन खरीदना चाहती है, वह भी CapEx में निवेश करेगी।\n\nइस प्रकार, CapEx एक कंपनी के विस्तार और विकास में महत्वपूर्ण भूमिका निभाता है और उसकी उन्नति में मदद करता है।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 12,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "ROE क्या होता है?",
                 description = "ROE (Return on Equity) कंपनी की प्रति शेयरहोल्डर की निवेश से कितनी लाभ कमाई है, यह बताता है। यह कंपनी के प्रतिफल को उसके पूंजी (इक्विटी) के साथ तुलना करता है। अगर ROE उच्च हो, तो यह कंपनी के प्रदर्शन का अच्छा संकेत होता है।\n\nROE की उच्चता दर्शाती है कि कंपनी अपने स्टॉकहोल्डर्स के पूंजी का अधिकतम उपयोग कर रही है और उसकी निवेश सामर्थ्य अच्छी है।\n\nइसका अर्थ है कि कंपनी अपने पूंजी को अधिक मापदंड से उपयोग करके अधिक लाभ कमा रही है।\n\nएक उच्च ROE संकेत देता है कि कंपनी का प्रबंधन और संचालन अच्छा है और वह निवेशकों को अच्छा रिटर्न प्रदान करने के लिए सक्षम है।\n\nइसलिए, निवेशकों को किसी कंपनी के ROE को समझने में मदद मिलती है और उन्हें निवेश करने के लिए योग्य कंपनी का चयन करने में मदद करती है। अगली बार ROE देखें जब आप किसी कंपनी में निवेश कर रहे हों।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id = 13,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "ROCE क्या होता है?",
                 description = "ROCE का मतलब \"Return on Capital Employed\" है। एक वित्तीय उपाय है जो दर्शाता है कि कंपनी ने अपने लगाए गए पूरे कैपिटल का कितना रिटर्न कमाया है। इसको समझने के लिए, एक सरल उदाहरण देखते हैं:\n\nसमझे एक काल्पनिक कंपनी XYZ है जिसकी कुल नियोजित पूंजी 1,00,000 है। क्या कंपनी ने एक वित्तीय वर्ष में 20,000 का मुनाफा कमाया है।\n\nअब ROCE गणना करने के लिए, हम लाभ को कुल नियोजित पूंजी से विभाजित करेंगे और फिर 100 से गुणा करेंगे:\n\nROCE=(Total Capital Employed Profit)×100\n\nइसका मतलब यह है कि कंपनी XYZ ने अपने लगायी गयी पूंजी पर 20% रिटर्न कमाया है। ये प्रतिशत अधिक होना अच्छा होता है, क्योंकि ये दर्शाता है कि कंपनी अपने फंड का कुशलतापूर्वक उपयोग कर रही है और अच्छा रिटर्न जनरेट कर रही है।\n\nलेकिन, सिर्फ ROCE को देखकर निवेश नहीं करना चाहिए। इसके साथ-साथ कंपनी के दूसरे बुनियादी सिद्धांत, उद्योग के रुझान, प्रतिस्पर्धा, भविष्य में विकास की संभावनाएं, और प्रबंधन का भी ध्यान रखना चाहिए। कुल मिलाकर, एक व्यापक विश्लेषण के बाद ही निवेश का निर्णय लेना चाहिए।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),

             ModelSubTopic(
                 id = 14,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "EBITDA क्या है?",
                 description = "EBITDA का मतलब है \"Earnings Before Interest, Taxes, Depreciation, and Amortization\"। यह एक वित्तीय माप है जो किसी कंपनी की ऑपरेशनल प्रदर्शन को मापता है। EBITDA वित्तीय रिपोर्टिंग में लाभ को निर्धारित करने का एक प्रमुख तरीका है, जो कंपनी की कारोबारीक सक्षमता को दर्शाता है।\n\nचलिए एक सरल उदाहरण के माध्यम से EBITDA को समझते हैं।\n\nमान लीजिए एक काल्पनिक कंपनी है, जिसका नाम XYZ Corporation है। क्या कंपनी के वार्षिक वित्तीय विवरण से हमें ये डेटा मिलता है:\n\nव्यावसायिक लाभ (परिचालन लाभ): 1,00,000\nब्याज (ब्याज): 20,000\nकर (कर): 30,000\nमूल्य वृद्धि (मूल्यह्रास): 10,000\nपरिशोधन (परिशोधन): 5,000\n\nअब हम EBITDA को Calculate करेंगे:\n\nEBITDA=व्यापारिकलाभ+ब्याज+कर+मूल्यवृद्धि+अमोर्टिजेशन\n\nEBITDA = 1,00,000 + 20,000 + 30,000 + 10,000 + 5,000\n\nEBITDA = 1,65,000\n\nइसका मतलब है कि XYZ कॉर्पोरेशन का EBITDA 1,65,000 है। ये राशि कंपनी के परिचालन प्रदर्शन को दर्शाती है, बिना ब्याज, कर, मूल्यह्रास, और परिशोधन को शामिल किए गये। EBITDA को देखते हुए, निवेशक और विश्लेषक कंपनी की परिचालन दक्षता और लाभप्रदता का एक विचार ले सकते हैं।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),

             ModelSubTopic(
                 id = 15,
                 topic = Constants.KEY_TOPIC_STOCK_MARKET,
                 title = "शेयर मूल्यों में उतार-चढ़ाव क्यों होते हैं?",
                 description = "शेयर मूल्यों में उतार-चढ़ाव कई कारणों से हो सकते हैं। यहाँ कुछ मुख्य कारण दिए गए हैं:\n\n1. आर्थिक प्रभाव: अर्थव्यवस्था में होने वाले बदलाव शेयर मूल्यों को प्रभावित कर सकते हैं। उदाहरण के लिए, बाजार में रुझान, सरकारी नीतियों का परिवर्तन, मुद्रा के मूल्य में बदलाव आदि।\n\n2. कंपनी का प्रदर्शन: एक कंपनी के आर्थिक प्रदर्शन, मूल्यक्रिया, निवेशकों की उम्मीदों के अनुसार उसके शेयर मूल्यों में उतार-चढ़ाव का कारण बन सकता है।\n\n3. बाजार के संदेश: बाजार के विभिन्न घटकों, जैसे कि वित्तीय समाचार, संदेश, उपाय, और अन्य घटकों के प्रभाव से शेयर मूल्यों में उतार-चढ़ाव हो सकता है।\n\n4. प्राकृतिक आपदाएँ और गतिशीलता: प्राकृतिक आपदाएँ, जैसे कि भूकंप, तूफान, और गतिशीलता, शेयर बाजार को प्रभावित कर सकते हैं, जिससे शेयर मूल्यों में उतार-चढ़ाव देखा जा सकता है।\n\nइन तत्वों के साथ-साथ, विभिन्न वित्तीय और अर्थशास्त्रीय कारकों के संयोजन से शेयर मूल्यों में उतार-चढ़ाव होता रहता है।",
                 imgUrl = "https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             ),


             ModelSubTopic(
                 id=16,
                 topic=Constants.KEY_TOPIC_STOCK_MARKET,
                 title="52 Week High-Low क्या है?",
                 description="52 Week High-Low वह शेयर की दो मुख्य कीमतें हैं जो उसके पिछले एक साल में प्राप्त की गई हैं।\n\n 52 Week High: यह उस शेयर की सबसे ऊंची कीमत है जो उसने पिछले एक साल में प्राप्त की है।\n\n 52 Week Low: यह उस शेयर की सबसे कम कीमत है जो उसने पिछले एक साल में प्राप्त की है।\nयह दोनों कीमतें शेयर की पिछली साल की वित्तीय स्थिति को दर्शाती हैं। निवेशक इस जानकारी का उपयोग करके शेयर के प्रदर्शन को अधिक समझ सकते हैं और निवेश के निर्णयों को लेते समय इसे ध्यान में रख सकते हैं",
                 imgUrl="https://images.moneycontrol.com/static-mcnews/2020/01/Investment-1-770x433.png?impolicy=website&width=770&height=431"
             )

         )//list end

    }

}