package com.bypriyan.sharemarketcourseinhindi.topicsDatas

import com.bypriyan.bustrackingsystem.utility.Constants
import com.bypriyan.sharemarketcourseinhindi.model.ModelSubTopic

object Trading {

    fun getTradingList(): List<ModelSubTopic> {
        return listOf(
            //ModelSubTopic(id = 1, topic = Constants.KEY_TOPIC_MUTUAL_FUNDS, title = "", description = "", imgUrl = "https://www.mstock.com/content/images/articles/category-banner/mutual-fund.webp")

            ModelSubTopic(
                id = 1,
                topic = Constants.KEY_TOPIC_TRADING,
                title = "ट्रेडिंग क्या है?",
                description = "ट्रेडिंग का मतलब होता है किसी वास्तु या सामान को खरीदना (Buy) और फिर उसे बेचना (Sell)। शेयर बाजार में ट्रेडिंग का अर्थ होता है कंपनी के शेयरों को खरीदना या बेचना, या फिर किसी और वित्तीय उत्पाद को खरीदना या बेचना, जैसे कि स्टॉक, कमोडिटी, मुद्राएं, या डेरिवेटिव।\n\nलोग ट्रेडिंग करके लाभ कमाने की कोशिश करते हैं, जिसमें वे शेयर या अन्य वित्तीय उत्पाद सही समय पर खरीदते और बेचते हैं, उम्मीद है कि उनका दाम बढ़ जाएगा या घट जाएगा।\n\nएक सरल उदाहरण यह हो सकता है कि आपने कुछ समय पहले एक टेलीकॉम कंपनी के 100 शेयर 100 रुपये प्रति शेयर में खरीदे थे। अब, कुछ महीनों बाद, आपको लगता है कि उस कंपनी के शेयर का मूल्य बढ़ेगा, तो आप उन 100 शेयरों को 150 रुपये प्रति शेयर में बेच देते हैं।\n\nइस प्रक्रिया को ट्रेडिंग कहा जाता है। आपका लाभ वहाँ परिक्षित हो जाता है, जब आप शेयरों को उससे अधिक कीमत पर बेचते हैं जिसके आपने खरीदे थे।",
                imgUrl = "https://png.pngtree.com/png-vector/20211007/ourlarge/pngtree-online-trading-stock-market-in-flat-png-image_3974395.png"
            ),

            ModelSubTopic(
                id = 2,
                topic = Constants.KEY_TOPIC_TRADING,
                title = "Trading कितने प्रकार की होती है?",
                description = "Trading कई प्रकार की होती है, जिसमें कुछ प्रमुख शामिल होते हैं:\n\n1. शेयर ट्रेडिंग: इसमें लोग शेयर बाजार में शेयरों को खरीदने और बेचने के लिए ट्रेड करते हैं। उनका लक्ष्य होता है शेयरों की मूल्यवृद्धि से लाभ कमाना। उदाहरण के लिए, अगर कोई व्यक्ति एक शेयर कंपनी के शेयर को किसी निम्न मूल्य पर खरीदता है और उसका मूल्य बाजार में बढ़ता है, तो वह उसे उच्च मूल्य पर बेचकर लाभ कमा सकता है।\n\n2. कमोडिटी ट्रेडिंग: इसमें लोग विभिन्न कमोडिटीज़ जैसे कि सोना, चांदी, कृषि उत्पाद, तेल, गहरे धातु आदि को खरीदने और बेचने के लिए ट्रेड करते हैं।\n\n3. फॉरेक्स ट्रेडिंग: इसमें लोग विभिन्न देशों की मुद्राओं को खरीदने और बेचने के लिए ट्रेड करते हैं।\n\nये कुछ मुख्य प्रकार के ट्रेडिंग के उदाहरण हैं। इनमें लोग अपने वित्तीय लक्ष्यों को प्राप्त करने के लिए विभिन्न उत्पादों में व्यापार करते हैं।",
                imgUrl = "https://png.pngtree.com/png-vector/20211007/ourlarge/pngtree-online-trading-stock-market-in-flat-png-image_3974395.png"
            ),

            ModelSubTopic(
                id = 3,
                topic = Constants.KEY_TOPIC_TRADING,
                title = "Intraday क्या है?",
                description = "भारतीय शेयर बाजार में, Intraday ट्रेडिंग का समय सुबह 9:15 बजे से लेकर शाम 3:30 बजे तक का होता है। इसमें ट्रेडर एक दिन के भीतर ही शेयरों को खरीदते और बेचते हैं। ट्रेडर का लक्ष्य यहां पर शेयर की मूल्य में आए परिवर्तन से लाभ कमाना होता है। इसमें ट्रेडरों को एक ही दिन के अंतराल में ही शेयरों को खरीदना और उन्हें बेचने का मौका मिलता है। इस तरह की ट्रेडिंग करने वाले ट्रेडर इंट्राडे ट्रेडर कहलाते हैं।",
                imgUrl = "https://png.pngtree.com/png-vector/20211007/ourlarge/pngtree-online-trading-stock-market-in-flat-png-image_3974395.png"
            ),

            ModelSubTopic(
                id = 4,
                topic = Constants.KEY_TOPIC_TRADING,
                title = "Swing Trading क्या है?",
                description = "Swing Trading एक वित्तीय ट्रेडिंग रणनीति है जिसमें ट्रेडर शेयरों को थोड़े दिनों या हफ्तों के लिए धारण करते हैं, जिससे वे मूल्य में होने वाले छोटे-छोटे परिवर्तनों से लाभान्वित हो सकें।\n\nएक उदाहरण के रूप में, यदि ट्रेडर किसी शेयर का विश्लेषण करते समय लगातार छह महीने के लिए उसके मूल्य में वृद्धि का अनुमान लगाता है और वह समय-समय पर होने वाली मूल्य गिरावट के बाद शेयरों को खरीदता है और उन्हें बेचता है, तो यह Swing Trading का उदाहरण हो सकता है। इसमें ट्रेडर छोटे-छोटे मूल्य उतार-चढ़ाव का लाभ उठाता है, जिससे वह लाभ कमा सकता है।",
                imgUrl = "https://png.pngtree.com/png-vector/20211007/ourlarge/pngtree-online-trading-stock-market-in-flat-png-image_3974395.png"
            ),
            ModelSubTopic(
                id = 5,
                topic = Constants.KEY_TOPIC_TRADING,
                title = "Scalping Trading क्या है?",
                description = "Scalping Trading एक वित्तीय ट्रेडिंग रणनीति है जिसमें ट्रेडर छोटे समय अंतरालों में छोटे-छोटे मुनाफे के लिए बहुत सारे ट्रेड करते हैं।\n\nउन्हें वित्तीय उत्पादों की तत्काल मूल्य उतार-चढ़ाव का लाभ उठाने की कोशिश होती है।\n\nएक उदाहरण के रूप में, ट्रेडर एक शेयर को कुछ ही समय के लिए खरीदता है, जैसे कि कुछ मिनटों के लिए, और जब उसकी मूल्य में थोड़ी सी वृद्धि होती है, तो वह उसे बेच देता है। यह ट्रेडर को अत्यंत छोटे समय अंतराल में छोटे-छोटे लाभ का लाभ उठाने की अनुमति देता है।\n\nइस तरह की ट्रेडिंग में, ट्रेडर के पास बहुत ही सावधानी और तेजी से निर्णय लेने की क्षमता होती है क्योंकि इसमें छोटे समय के भीतर ही निवेश का निर्णय लिया जाता है।",
                imgUrl = "https://png.pngtree.com/png-vector/20211007/ourlarge/pngtree-online-trading-stock-market-in-flat-png-image_3974395.png"
            ),


            ModelSubTopic(
                id = 6,
                topic = Constants.KEY_TOPIC_TRADING,
                title = "Positional Trading क्या है?",
                description = "Positional Trading एक वित्तीय ट्रेडिंग रणनीति है जिसमें ट्रेडर वित्तीय उत्पादों को लंबे समय तक धारण करते हैं, जैसे कि कुछ हफ्तों, महीनों, या वर्षों के लिए। इसमें ट्रेडर का लक्ष्य उन वित्तीय उत्पादों के मूल्य में होने वाले बड़े परिवर्तनों का लाभ उठाना होता है।\n\nउदाहरण के लिए, यदि ट्रेडर किसी शेयर के मूल्य में बड़े परिवर्तनों का अनुमान लगाता है और उसकी मूल्य में वृद्धि का आशंका होता है, तो वह उस शेयर को कुछ हफ्तों या महीनों के लिए धारण कर सकता है। जब शेयर की मूल्य में उन्हें अपने लक्ष्य में परिवर्तन मिलता है, तो वह उसे बेच देता है और लाभ कमाता है।\n\nइस तरह की ट्रेडिंग में, ट्रेडर को वित्तीय उत्पादों के मूल्य के बड़े परिवर्तनों को पकड़ने की क्षमता होती है, जिससे वह लंबे समय तक होने वाले बड़े लाभ का लाभ उठा सकता है।",
                imgUrl = "https://png.pngtree.com/png-vector/20211007/ourlarge/pngtree-online-trading-stock-market-in-flat-png-image_3974395.png"
            ),


            ModelSubTopic(
                id = 7,
                topic = Constants.KEY_TOPIC_TRADING,
                title = "Trading और Investment में क्या अंतर है?",
                description = "Trading और Investment दोनों ही वित्तीय कार्यक्रम हैं, लेकिन इनके बीच मुख्य अंतर है।\n\n1. Trading (व्यापार):\n\n- ट्रेडिंग में व्यक्ति वित्तीय उत्पादों को शॉर्ट टर्म में खरीदता और बेचता है।\n- इसमें व्यक्ति वित्तीय उत्पादों को कुछ ही समय के लिए होल्ड करता है, जिससे छोटे-मध्यम अंतराल में लाभ कमाया जा सके।\n- उदाहरण के रूप में, एक ट्रेडर शेयरों को एक दिन के भीतर ही खरीदता और बेचता है।\n\n2. Investment (निवेश):\n\n- निवेश में व्यक्ति वित्तीय उत्पादों को लंबे समय तक धारण करता है।\n- इसमें व्यक्ति वित्तीय उत्पादों को बड़े समय तक होल्ड करता है, जिससे वह वित्तीय स्वाधीनार का उत्तरदायी बन सके।\n- उदाहरण के रूप में, एक निवेशक शेयरों को वर्षों तक धारण कर सकता है और उनकी मूल्य में वृद्धि के साथ-साथ डिविडेंड का भी लाभ उठा सकता है।\n\nइस प्रकार, ट्रेडिंग और निवेश में मुख्य अंतर यह है कि ट्रेडिंग शॉर्ट टर्म के लिए होती है जबकि निवेश लंबे समय के लिए होता है।",
                imgUrl = "https://png.pngtree.com/png-vector/20211007/ourlarge/pngtree-online-trading-stock-market-in-flat-png-image_3974395.png"
            )
        )
    }
}